{"content": "The following is adapted from a press release issued today by the Broad Institute of MIT and Harvard.\nThe Broad Institute today announced an unprecedented commitment of $650 million from philanthropist Ted Stanley aimed at galvanizing scientific research on psychiatric disorders and bringing new treatments based on molecular understanding to hundreds of millions of people around the world.\nThe Stanley commitment  the largest ever in psychiatric research, and among the largest for scientific research in general  will support research by a collaborative network of researchers within the Stanley Center for Psychiatric Research at the Broad Institute, a biomedical research institution that brings together faculty from MIT, Harvard University, Harvard-affiliated hospitals, and collaborators worldwide.\nStanleys commitment to support the work of the Broad Institute will consist of annual gifts during his lifetime followed by a bequest, with a total current value exceeding $650 million. Taking prior gifts into account, Stanleys philanthropy in support of the Broad Institutes work totals more than $825 million.\nThe Stanley commitment is an extraordinary opportunity for MIT scientists and the larger Broad Institute research community, MIT President L. Rafael Reif says. I join the Broad Institute in expressing my gratitude to Ted Stanley.\nThe biological causes of mental illnesses such as schizophrenia and bipolar disorder have mystified scientists for decades; in the last five years, however, understanding has accelerated dramatically, driven by advances in human genomics. Because researchers cannot study the biochemistry of the living human brain, the genes that predispose people to schizophrenia and bipolar disorder represent the best way to gain molecular insights into these disorders. The discovery of specific genes associated with these disorders provides significant clues to their biological basis and points to possible molecular targets for novel therapies.\nSince 2004, Ted Stanley and his late wife, Vada Stanley, have been instrumental to the progress made thus far in identifying the genetic risk factors for schizophrenia and bipolar disorder, and the initiation of therapeutic efforts based on those discoveries. Their gifts made possible the establishment of the Stanley Center at the Broad Institute in 2007 and helped support an international collaboration that today involves scientists in 25 countries. Stanleys new commitment is the culmination of a 25-year personal mission to discover the biology of psychiatric disorders and lay the groundwork for effective therapies.\nHuman genomics has begun to reveal the causes of these disorders. We still have a long way to go, but for the first time we can point to specific genes and biological processes. Its now time to step on the gas pedal, Stanley says. I am devoting my personal wealth to this goal. But it will take all of us  philanthropists, government funding agencies, scientists, patients, and families  working together to achieve it.\nThis is a pivotal moment, says Thomas Insel, director of the National Institute of Mental Health (NIMH). We are finally beginning to gain the deep knowledge about these disorders that we have sought for decades.\nYears of frustration give way to progress\nMental illness exacts an enormous human toll. The leading cause of disability in the United States, it affects millions and most often strikes patients while they are young and otherwise healthy. Biomedical researchers have struggled for years to understand the molecular causes of serious ailments such as schizophrenia and bipolar disorder. Until five years ago, there was no clear scientific evidence around even a single gene that contributes to causing either disorder.\nResearch to develop new treatments has also stalled. No fundamentally new drugs have been introduced since the 1950s. All but a handful of pharmaceutical companies have abandoned the pursuit of new treatments because the basic science has seemed intractable.\nYet in the past few years, scientists have begun to find genes that shape the risk of schizophrenia, bipolar disorder, and other illnesses  thanks in large part to Stanleys support. Researchers at the Broad Institute have harnessed DNA mapping and sequencing technology; supported collaborative networks of researchers from more than 60 institutions in 25 countries; and assembled the worlds largest collection of DNA samples in psychiatric research  currently more than 175,000 samples  including schizophrenia, bipolar disorder, autism, attention deficit hyperactivity disorder, and healthy control samples. Analysis of 80,000 of these samples so far by Broad researchers and collaborators has linked more than 100 genomic regions to schizophrenia and begun to identify specific gene mutations and the critical underlying biological processes, such as an impaired ability of neurons to communicate with each other. Significant efforts are ramping up in bipolar disorder, autism, and other conditions.\nWe are going to illuminate the biology behind these conditions, says Eric Lander, founding director and president of the Broad Institute, and a professor of biology at MIT. If we know the biological causes, we can begin to dispel the stigma around people battling mental illness, and rigorously pursue better treatments that will transform patients lives.\nThree lives converge on a shared scientific mission\nThis scientific success  and the historic commitment of funding announced today  stems, in large part, from the devotion of three extraordinary people whose lives converged at the Broad Institute.\nStanleys passion for the cause began decades ago when his son, Jonathan, was stricken with severe bipolar disorder while in college. The first few years were difficult, but Jonathan overcame his illness with the help of lithium, a landmark drug first used to treat patients with mental illness in 1949. Now a successful attorney, Jonathan is also a founding board member of the Treatment Advocacy Center, a nonprofit organization dedicated to reforming laws that affect persons with a mental illness, and an advocate for the National Alliance on Mental Illness.\nAlthough lithium helped give Jonathan a normal life, other patients who suffer from mental illness have not been as fortunate. Hoping to help these patients, Ted and Vada Stanley went on to found the Stanley Medical Research Institute in 1989, aimed at finding treatments that would be as effective for others as lithium has been for their son.\nWhen Edward Scolnick met the Stanleys, he had had a stellar career, first in cancer research in the 1970s and then as one of the most respected scientists in the pharmaceutical industry. As president of Merck Research Laboratories, Scolnick led the development of the first drugs to effectively combat HIV; the first drugs to effectively treat high cholesterol, statins; the first vaccine against cervical cancer; and many other breakthroughs. Instead of retiring, Scolnick took on a new challenge: He moved to the Broad Institute to tackle mental illness because he had a deep personal interest in the field. Early in his career, Scolnick had helped launch a revolution in cancer research based on the discovery of the first cancer genes. He wanted to set psychiatric research on the same path.\nScolnick vividly remembers the moment he and the Stanleys joined forces. He told them, If you want to get at the molecular pathogenesis of these disorders, youve got to crack the genetics. Thats what has held this field back for so long.\nThe Stanleys had given many small grants to support psychiatric research through their foundation, but Scolnick argued for the importance of critical mass  and asked them to contribute $10 million to launch a program at the Broad Institute. Ted Stanley agreed, and after clear initial progress called Scolnick back with a new proposal: Lets do something bigger. How about we give you $100 million over 10 years? Thus, the Stanley Center for Psychiatric Research at the Broad was launched in 2007, with Scolnick as its founding director.\nThe third player was Steven Hyman, who at the time was provost at Harvard. Before taking that post, Hyman, a psychiatrist, had served as head of NIMH from 1996 to 2001. (Scolnick served as a member of Hymans National Advisory Mental Health Council from 1998 to 2002, and Lander served as a member of the NIMHs Genetics Workgroup; the three had developed a mutual respect and a shared vision for what was needed in the field.) As director, Hyman led the NIMH to invest in both neuroscience and genetics, and, along with Scolnick and Lander, supported the collection of DNA samples from patients, with the hope that the samples could someday be analyzed to find disease genes.\nBut progress was slow, partly because the Human Genome Project had not yet been completed. When Hyman left the NIMH in 2001 to become provost of Harvard, he had almost completely lost hope that true progress could be made in his lifetime in elucidating the mechanisms of psychiatric illness.\nHyman helped launch the Broad Institute of MIT and Harvard in 2004 and, over time, became encouraged by the Broads progress in the molecular understanding of psychiatric disorders. After nine years as Harvard provost, he joined the Broad and then became the director of the Stanley Center in 2012.\nTen years ago, finding the biological causes of psychiatric disorders was like trying to climb a wall with no footholds, says Hyman, who is also the Distinguished Service Professor of Stem Cell and Regenerative Biology at Harvard. But in the last few years, weve turned this featureless landscape into something we can exploit. If this is a wall, weve put toeholds into it. Now, we have to start climbing.\nA unique and powerful research model\nThe Stanley Centers rapid progress was possible only because of the unique nature of the Broad Institute, its home institution. The Broad Institute grew from an MIT-based flagship center for the Human Genome Project, and generated one-third of the DNA sequence data for that project  the single largest contribution to the effort. Formally founded in 2004 to fulfill the promise of the Human Genome Project by facilitating collaborative biomedical research across disciplines and institutions, it brings together faculty from MIT, Harvard, and the five major Harvard-affiliated hospitals: Beth Israel Deaconess Medical Center, Boston Childrens Hospital, Brigham and Womens Hospital, Dana-Farber Cancer Institute, and Massachusetts General Hospital.\nCelebrating its 10th anniversary this month, the Broad Institute is today home to a community of more than 2,000 members, including physicians, biologists, chemists, computer scientists, engineers, staff, and representatives of many other disciplines. Together, the Broad Institute community uses industrial-strength technological capabilities to take on challenges too great for any single lab or institution to tackle.\nBroad investigators have led international consortia that have found thousands of genetic variants responsible for common diseases such as diabetes, heart disease, and Crohns disease  and translated that knowledge into descriptions of the underlying biological processes, a critical step in the development of rationally designed drugs. They have discovered several hundred genes that are mutated in cancer and applied this knowledge to begin to invent new, targeted forms of therapy. Broad scientists have also invented powerful new tools that allow researchers to precisely manipulate the genome and measure the millions of complex chemical interactions within cells. In the spirit of the Human Genome Project, the Broad makes its genomic data freely available to researchers around the world.\nThe future of psychiatric research\nThe Stanley Center engages a community of more than 150 scientists at the Broad Institute and its partner institutions. Over the coming years, the center plans to draw on Stanleys tremendous generosity to accomplish at least four major goals:\nComplete the list of all genes that play roles in severe psychiatric disorders, including schizophrenia, bipolar disorder, autism, and others. To create a comprehensive catalog of the genetic variation that underlies mental illness, the researchers plan to expand their international network and draw in many more collaborators with new insights and capabilities. They also plan to expand their sample collection efforts dramatically  especially among understudied populations, such as those in African nations  to reveal the many as-yet-undiscovered mutations relevant to disease. As a first step, they plan to carry out comprehensive analysis of all genes that specify the protein building blocks of cells from 100,000 samples in the next two years.\nReveal the biological pathways in which these genes act. To do so, they will push technological boundaries, working with new techniques that allow them to manipulate and comprehensively measure the dynamic activity of genes in living cells, including lab-grown neurons produced by new stem-cell technologies. Their ultimate, ambitious goal: to determine where, when, and how these genes act in human brain cells, and how in psychiatric patients those processes may go awry.\nDevelop cellular and animal models that faithfully mimic human disorders. In contrast to researchers studying cancer or diabetes, researchers studying psychiatric disorders have been unable to identify animal models that correctly capture important biological aspects of the disorders and correctly predict which therapies will be effective in humans. Now, with growing knowledge of the genes underlying psychiatric disorders, Broad researchers plan to create cellular models in the laboratory and animal models that more faithfully match both the genetic variation and the biochemical processes seen in human patients. They plan to pioneer cutting-edge techniques such as genome editing, which allows them to precisely introduce any mutations they choose.\nDevelop chemicals to modulate biological pathways to serve as drug leads. The researchers plan to build on the existing therapeutic efforts within the Stanley Center and draw on the Broads Therapeutics Platform  a technological powerhouse with the capacity to create and screen hundreds of thousands of compounds  to identify molecules that can powerfully and precisely influence specific biological pathways relevant to psychiatric disorders. They then plan to comprehensively investigate those chemicals effects to determine which of them might serve as promising leads for drugs that could be safely and effectively used in humans.\nWere still at the beginning of the curve of translating the emerging genetics into actionable biology, but its happening much faster than I thought it would, Scolnick says. Id be bold enough to say that in five years, all the drug companies that got out of psychiatric research will be getting back in. The coming decades of psychiatric research will yield new science and a needed parallel effort to increase resources for services that can help patients and their families.\nAbout the Stanley Center for Psychiatric Research\nThe mission of the Stanley Center for Psychiatric Research at the Broad Institute is to reduce the burden of serious mental illness through research. Stanley Center researchers focus on schizophrenia, bipolar disorder, autism, attention deficit hyperactivity disorder, and other neuropsychiatric disorders. Situated within the Broad Institute of MIT and Harvard, the Stanley Center aims to exploit the most advanced technologies for human genetic analysis to study these psychiatric disorders in order to understand disease mechanisms, identify potential biomarkers, and ignite needed progress in therapeutics. \nLaunched in 2007 by a $100 million commitment from the Stanley Medical Research Institute, the Stanley Center has extensive collaborations with investigators at MIT, Harvard, and the Harvard-affiliated hospitals, as well as with investigators around the world.\nAbout the Broad Institute of MIT and Harvard\nThe Eli and Edythe L. Broad Institute of MIT and Harvard was launched in 2004 to empower this generation of creative scientists to transform medicine. The Broad Institute seeks to describe all the molecular components of life and their connections; discover the molecular basis of major human diseases; develop effective new approaches to diagnostics and therapeutics; and disseminate discoveries, tools, methods, and data openly to the entire scientific community.\nFounded by MIT, Harvard and its affiliated hospitals, and the visionary Los Angeles philanthropists Eli and Edythe L. Broad, the Broad Institute includes faculty, professional staff, and students from throughout the MIT and Harvard biomedical research communities and beyond, with collaborations spanning more than 100 private and public institutions in more than 40 countries worldwide. ", "tags": ["Broad Institute", "Giving", "Psychiatric disorders", "Mental health", "Health", "Research", "Neuroscience", "Brain and cognitive sciences", "Biology"], "title": "$650 million commitment to Stanley Center at Broad Institute aims to galvanize mental illness research"}