{"content": "There are only five bodies in our solar system that are known to bear rings. The most obvious is the planet Saturn; to a lesser extent, rings of gas and dust also encircle Jupiter, Uranus, and Neptune. The fifth member of this haloed group is Chariklo, one of a class of minor planets called centaurs: small, rocky bodies that possess qualities of both asteroids and comets.\nScientists only recently detected Chariklo’s ring system — a surprising finding, as it had been thought that centaurs are relatively dormant. Now scientists at MIT and elsewhere have detected a possible ring system around a second centaur, Chiron.\nIn November 2011, the group observed a stellar occultation in which Chiron passed in front of a bright star, briefly blocking its light. The researchers analyzed the star’s light emissions, and the momentary shadow created by Chiron, and identified optical features that suggest the centaur may possess a circulating disk of debris. The team believes the features may signify a ring system, a circular shell of gas and dust, or symmetric jets of material shooting out from the centaur’s surface.\n“It’s interesting, because Chiron is a centaur — part of that middle section of the solar system, between Jupiter and Pluto, where we originally weren’t thinking things would be active, but it’s turning out things are quite active,” says Amanda Bosh, a lecturer in MIT’s Department of Earth, Atmospheric and Planetary Sciences.\nBosh and her colleagues at MIT — Jessica Ruprecht, Michael Person, and Amanda Gulbis — have published their results in the journal Icarus.\nCatching a shadow\nChiron, discovered in 1977, was the first planetary body categorized as a centaur, after the mythological Greek creature — a hybrid of man and beast. Like their mythological counterparts, centaurs are hybrids, embodying traits of both asteroids and comets. Today, scientists estimate there are more than 44,000 centaurs in the solar system, concentrated mainly in a band between the orbits of Jupiter and Pluto.\nWhile most centaurs are thought to be dormant, scientists have seen glimmers of activity from Chiron. Starting in the late 1980s, astronomers observed patterns of brightening from the centaur, as well as activity similar to that of a streaking comet.\nIn 1993 and 1994, James Elliot, then a professor of planetary astronomy and physics at MIT, observed a stellar occultation of Chiron and made the first estimates of its size. Elliot also observed features in the optical data that looked like jets of water and dust spewing from the centaur’s surface.\nNow MIT researchers — some of them former members of Elliot’s group — have obtained more precise observations of Chiron, using two large telescopes in Hawaii: NASA’s Infrared Telescope Facility, on Mauna Kea, and the Las Cumbres Observatory Global Telescope Network, at Haleakala.\nIn 2010, the team started to chart the orbits of Chiron and nearby stars in order to pinpoint exactly when the centaur might pass across a star bright enough to detect. The researchers determined that such a stellar occultation would occur on Nov. 29, 2011, and reserved time on the two large telescopes in hopes of catching Chiron’s shadow.\n“There's an aspect of serendipity to these observations,” Bosh says. “We need a certain amount of luck, waiting for Chiron to pass in front of a star that is bright enough. Chiron itself is small enough that the event is very short; if you blink, you might miss it.”\nThe team observed the stellar occultation remotely, from MIT’s Building 54. The entire event lasted just a few minutes, and the telescopes recorded the fading light as Chiron cast its shadow over the telescopes.\nRings around a theory\nThe group analyzed the resulting light, and detected something unexpected. A simple body, with no surrounding material, would create a straightforward pattern, blocking the star’s light entirely. But the researchers observed symmetrical, sharp features near the start and end of the stellar occultation — a sign that material such as dust might be blocking a fraction of the starlight.\nThe researchers observed two such features, each about 300 kilometers from the center of the centaur. Judging from the optical data, the features are 3 and 7 kilometers wide, respectively.  The features are similar to what Elliot observed in the 1990s.\nIn light of these new observations, the researchers say that Chiron may still possess symmetrical jets of gas and dust, as Elliot first proposed. However, other interpretations may be equally valid, including the “intriguing possibility,” Bosh says, of a shell or ring of gas and dust.\nRuprecht, who is a researcher at MIT’s Lincoln Laboratory, says it is possible to imagine a scenario in which centaurs may form rings: For example, when a body breaks up, the resulting debris can be captured gravitationally around another body, such as Chiron. Rings can also be leftover material from the formation of Chiron itself.\n“Another possibility involves the history of Chiron’s distance from the sun,” Ruprecht says. “Centaurs may have started further out in the solar system and, through gravitational interactions with giant planets, have had their orbits perturbed closer in to the sun. The frozen material that would have been stable out past Pluto is becoming less stable closer in, and can turn into gases that spray dust and material off the surface of a body. ”   \nAn independent group has since combined the MIT group’s occultation data with other light data, and has concluded that the features around Chiron most likely represent a ring system. However, Ruprecht says that researchers will have to observe more stellar occultations of Chiron to truly determine which interpretation — rings, shell, or jets — is the correct one.\n“If we want to make a strong case for rings around Chiron, we’ll need observations by multiple observers, distributed over a few hundred kilometers, so that we can map the ring geometry,” Ruprecht says. “But that alone doesn’t tell us if the rings are a temporary feature of Chiron, or a more permanent one. There’s a lot of work that needs to be done.”\nNevertheless, Bosh says the possibility of a second ringed centaur in the solar system is an enticing one.\n“Until Chariklo’s rings were found, it was commonly believed that these smaller bodies don’t have ring systems,” Bosh says. “If Chiron has a ring system, it will show it’s more common than previously thought.”\nMatthew Knight, an astronomer at the Lowell Observatory in Flagstaff, Arizona, says the possibility that Chiron possesses a ring system “makes the solar system feel a bit more intimate.”\n“We have a pretty good feel for what most of the inner solar system is like from spacecraft missions, but the small, icy worlds of the outer solar system are still mysterious,” says Knight, who was not involved in the research. “At least to me, being able to picture a centaur having a ring around it makes it seem more tangible.”\nThis research was funded in part by NASA and the National Research Foundation of South Africa.", "tags": ["Astronomy", "Astrophysics", "NASA", "Physics", "Research", "space", "Space, astronomy and planetary science\"", "EAPS", "", ""], "title": "A second minor planet may possess Saturn-like rings"}