{"content": "One of the biggest puzzles in neuroscience is how our brains encode thoughts, such as perceptions and memories, at the cellular level. Some evidence suggests that ensembles of neurons represent each unique piece of information, but no one knows just what these ensembles look like, or how they form.\nA new study from researchers at MIT and Boston University (BU) sheds light on how neural ensembles form thoughts and support the flexibility to change ones mind. The research team, led by Earl Miller, the Picower Professor of Neuroscience at MIT, identified groups of neurons that encode specific behavioral rules by oscillating in synchrony with each other.\nThe results suggest that the nature of conscious thought may be rhythmic, according to the researchers, who published their findings in the Nov. 21 issue of Neuron.\nAs we talk, thoughts float in and out of our heads. Those are all ensembles forming and then reconfiguring to something else. Its been a mystery how the brain does this, says Miller, who is also a member of MITs Picower Institute for Learning and Memory. Thats the fundamental problem that were talking about  the very nature of thought itself.\nRules for behavior\nThe researchers identified two neural ensembles in the brains of monkeys trained to respond to objects based on either their color or orientation. This task requires cognitive flexibility  the ability to switch between two distinct sets of rules for behavior.\nEffectively what theyre doing is focusing on some parts of information in the world and ignoring others. Which behavior theyre doing depends on the context, says Tim Buschman, an MIT postdoc and one of the lead authors of the paper.\nAs the animals switched between tasks, the researchers measured the brain waves produced in different locations throughout the prefrontal cortex, where most planning and thought takes place. Those waves are generated by rhythmic fluctuations of neurons electrical activity.\nWhen the animals responded to objects based on orientation, the researchers found that certain neurons oscillated at high frequencies that produce so-called beta waves. When color was the required rule, a different ensemble of neurons oscillated in the beta frequency. Some neurons overlapped, belonging to more than one group, but each ensemble had its own distinctive pattern.\nInterestingly, the researchers also saw oscillations in the low-frequency alpha range among neurons that make up the orientation rule ensemble, but only when the color rule was being applied. The researchers believe that the alpha waves, which have been associated with suppression of brain activity, help to quiet the neurons that trigger the orientation rule.\nWhat this suggests is that orientation was dominant, and color was weaker. The brain was throwing this blast of alpha at the orientation ensemble to shut it up, so the animal could use the weaker ensemble, Miller says.\nThe findings could explain how the brain can create any appropriate behavioral response to the countless possible combinations of stimuli, rules and required actions, says Pascal Fries, director of the Ernst Strungmann Institute for Neuroscience in Frankfurt, Germany.\nWe likely compose the appropriate neuronal assembly on the fly through synchronization, says Fries, who was not part of the research team. The number of combinatorial possibilities is enormous, just like the number of possible 10-digit telephone numbers is.\nEric Denovellis, a graduate student at Boston University, is also a lead author of the paper. Other authors are Cinira Diogo, a former Picower Institute postdoc, and Daniel Bullock, a professor of cognitive and neural systems at BU.\nOscillation as consciousness\nThe researchers are now trying to figure out how these neural ensembles coordinate their activity as the brain switches back and forth between different rules, or thoughts. Some neuroscientists have theorized that deeper brain structures, such as the thalamus, handle this coordination, but no one knows for sure, Miller says. Its one of the biggest mysteries of cognition, what controls your thoughts, he says.\nThis work could also help unravel the neural basis of consciousness.\nThe most fundamental characteristic of consciousness is its limited capacity. You only can hold a very few thoughts in mind simultaneously, Miller says. These oscillations may explain why that is: Previous studies have shown that when an animal is holding two thoughts in mind, two different ensembles oscillate in beta frequencies, out of phase with one another.\nThat immediately suggests why theres a limited capacity to consciousness: Only so many balls can be kept in the air at the same time, only a limited amount of information can fit into one oscillatory cycle, Miller says. Disruptions of these oscillations may be involved in neurological disorders such as schizophrenia; studies have shown that patients with schizophrenia have reduced beta oscillations.\nThe research was funded by the National Science Foundation and the National Institute of Mental Health.", "tags": ["Brain and cognitive sciences", "Faculty", "Neuroscience", "Picower Institute for Learning and Memory", "Research", "Behavior", "Cognition", "National Science Foundation (NSF)", "Neural oscillation", ""], "title": "Brain waves encode rules for behavior"}