{"content": "Chief Executive Leung Chun-ying of Hong Kong visited MIT Tuesday morning, engaging in a lively dialogue with faculty and Institute leaders about university-driven innovation.\nLeung toured portions of the MIT Media Laboratory, participated in a roundtable discussion with MIT professors about developing innovation ecosystems, and held a private meeting with Provost Martin Schmidt.\nHong Kong is very much a cosmopolitan and international city, Leung said, adding, Therefore we look for collaborative activities.\nOn the subject of directing academic research toward spurring innovation in the larger economy, Leung said he thinks that this model is working in Hong Kong, but that he would very much like to work with our friends at MIT on finding further ways of applying research toward production and growth.\nThe faculty who took part in a group discussion with Leung praised MITs existing partnerships with Hong Kong, noted some areas of development for the region, and emphasized the importance of analyzing the conditions in which innovation grows.\nFiona Murray, the Bill Porter Professor of Entrepreneurship, associate dean for innovation at the MIT Sloan School of Management, and co-director of the MIT Innovation Initiative, pointed out to Leung that MIT engages in technological development, and also studies the enterprise.\nWe practice innovation on a very regular basis, Murray said. But we also engage in the science of innovation.\nFinding the right balance in research\nIndeed, as the MIT faculty engaging with Leung observed, finding the right combination of pure research and applied activities remains a key to technology-based growth.\nMedia Lab Director Joi Ito, who guided Leung at the outset of his visit and participated in the roundtable, observed that many of the labs corporate partners give its researchers a wide berth to pursue their work. On the other hand, Ito noted during the roundtable discussion, the goal of many researchers now is to have a rapid, real-world impact through their work.\nAs Ito stated, the Media Lab has updated its well-known motto about producing prototypes  demo or die  to deploy or die, representing the goal of placing finished products in the world.\nCharles Sodini, the Clarence J. LeBel Professor in Electrical Engineering, said that research results sow the seeds of innovation. However, as he added, there is a fine balance of where you want to be in terms of balancing pure and applied research activities.\nVincent Chan, the Joan and Irwin M. Jacobs Professor in MITs Department of Electrical Engineering and Computer Science, and a native of Hong Kong, suggested that Hong Kong has significant growth opportunities in computer hardware and in financial technologies, from security to data management and data analysis. Compared with some neighbors in the region, Chan said, technologists may be more creative in Hong Kong, and could flourish in significant high-tech sectors.\nAlex Sandy Pentland, the Toshiba Professor of Media Arts and Sciences, suggested that Hong Kong might have an interesting role to play in guiding the U.S. and China toward new forms of agreement on international data security and privacy, though he added, I think that only works if everybody is a stakeholder.\nHong Kong has been a Chinese administrative region since 1997, when it was handed over from British control. The area enjoys considerable autonomy from China, and is a leading center of global finance. It is also, as Leung noted, heavily oriented around the service economy, leaving room for technology-based growth.\nModeling Hong Kong, block by block?\nEarlier in his visit, Leung was shown three labs in the Media Lab. In the Tangible Media group, director Hiroshi Ishii, the Jerome B. Wiesner Professor, showed Leung numerous new kinds of tangible interfaces for digital information. In the Changing Places lab, director Kent Larson helped show Leung a variety of innovations, from Lego-based urban models to prototypes of autonomous vehicles.\nLeung showed flashes of humor while engaging with MIT researchers about the potential uses of these innovations. \nWhile examining a Lego-based city model that provides real-time estimates of factors such as energy consumption and walkability, Leung joked that in Hong Kong, people would also want to know the shopability ratings of their locations.\nViewing a half-size prototype of a very compact urban automobile, Leung quipped, Maybe you can make large, medium, and small sizes of the vehicles for people. \nMIT and Hong Kong have developed growing ties in recent years, a relationship that is set to expand following a $118 million gift this January from Samuel Tak Lee 62 SM 64, a real estate developer whose work has significantly focused on Hong Kong, among other global cities. The gift will promote social responsibility among entrepreneurs and academics in real estate, among other things.\nSumming up the visit, Leung said it was a great pleasure and privilege to be at MIT, pledging again his interest in identifying subjects for collaboration in the future.", "tags": ["Media Lab", "Sloan School of Management", "Global", "Asia", "Provost", "Special events and guest speakers", "Innovation and Entrepreneurship (I&E)", "Innovation Initiative"], "title": "Chief Executive Leung Chun-ying of Hong Kong visits MIT"}