{"content": "Researchers at MIT and Northwestern University have developed a new peer-to-peer networking tool that enables sufferers of anxiety and depression to build online support communities and practice therapeutic techniques.\nIn a study involving 166 subjects who had exhibited symptoms of depression, the researchers compared their tool with an established technique known as expressive writing. The new tool yielded better outcomes across the board, but it had particular advantages in two areas: One was in training subjects to use a therapeutic technique called cognitive reappraisal, and the other was in improving the mood of subjects with more severe symptoms.\n“We really wanted to see two things,” says Rob Morris, who led the work as a PhD student in media arts and sciences at MIT. After graduating in February, Morris is now commercializing the technology through a New York-based company he co-founded, called Koko. “Could people get clinical benefits from it? That’s hypothesis one,” he says.\n“Hypothesis two is, ‘Will people be engaged and use this regularly?’” Morris adds. “There’s a lot of great work in building web apps and mobile apps to provide psychotherapy without a therapist in the loop — it’s these self-guided programs. There’s almost a decade of research showing that these things can produce really profound improvements for people. The problem is that, once you release them out into the wild, people just don’t use them. The way we designed our platform was to really mimic some of the interaction paradigms that underlie very engaging social programs.”\nOn that score, too, the results of the study were encouraging. The average subject in the control group used the expressive-writing tool 10 times over the three weeks of the study, with each session lasting about three minutes. The average subject using the new tool logged in 21 times, with each session lasting about nine minutes.\nBuggy thinking\nMorris; his thesis advisor, Rosalind Picard, an MIT professor of media arts and sciences; and Stephen Schueller, a clinical psychologist at Northwestern, describe the study in a paper appearing this week in the Journal of Medical Internet Research.\nMorris, who had majored in psychology as an undergrad at Princeton University, initially enrolled in a PhD program in psychology in California. But he concluded that a traditional psychology program wouldn’t grant him enough latitude in researching the therapeutic potential of information technology, a topic that quickly captured his interest. So he applied instead to do graduate work in Picard’s Affective Computing Group, which specifically investigates the intersection of computing technologies and human emotions.\n“I was at MIT without an engineering degree and really trying to race to learn computer programming,” Morris recalls. He found himself spending a lot of time on a programmers’ question-and-answer site called Stack Overflow. “Whenever I had a bug or was stuck on something, I would go on there, and almost miraculously, this crowd of programmers would come and help me,” he says. “It was just this intuition that, just as we can get people on Stack Overflow to help us identify and fix bugs in code, perhaps we can harness a crowd to help us fix bugs in our thinking.”\nPeople suffering from depression frequently exhibit what Morris describes as “maladaptive thought patterns”: You lose your job, and you conclude that you’ll never find another one; your roommate comes home and shuts herself up in her room, and you assume it’s because of something you’ve done.\nPsychologists have sorted these thought patterns into categories. Predicting your future unemployability is an instance of “fortune-telling”; assuming you know your roommate’s motivations is “mind-reading.” Others include “overgeneralization,” “catastrophizing,” and “all-or-nothing thinking.”\nCognitive reappraisal involves, first, identifying maladaptive thought patterns and, second, trying to recast the events that precipitated them in a different light: The job you lost offered no room for promotion and wasn’t aligned with your interests, anyway; your roommate has been having trouble at work and may have just had a fight with a colleague.\nStrength in numbers\nA user of the new tool — which Morris calls Panoply — logs on and, in separate fields, records both a triggering event and his or her response to it. This much of the application was duplicated exactly for the expressive-writing tool used by the control group in the study.\nWith Panoply, however, members of the network then vote on the type of thought pattern represented by the poster’s reaction to the triggering event and suggest ways of reinterpreting it. As users demonstrate more and more familiarity with techniques of cognitive reappraisal, they graduate from describing their own experiences, to offering diagnoses of other people’s thought patterns, to suggesting reinterpretations.\n“We really wanted to see that people are utilizing this skill over and over again, not only in response to their own stressors but also as teachers to other people,” Morris says. “We can surmise that it’s a little easier to practice some of these psychotherapeutic skills for other people before turning them toward themselves. But we don’t have data supporting that.”\nFor their study, Morris, Picard, and Schueller recruited subjects who described themselves as under stress, something that correlates highly with depression. Volunteers were asked to complete three questionnaires. One is a depression measure that’s standard in the field. Another assesses perseverative thinking, and the third assesses skill at cognitive reappraisal. After three weeks using either Panoply or the expressive-writing tool, the subjects again completed the same three questionnaires.\nNetwork effects\nTo simulate a large network of users — and ensure that Panoply users would receive replies even if they were posting in the middle of the night — Morris hired online workers through Amazon’s Mechanical Turk crowdsourcing application to supplement the comments made by study subjects. Each Mechanical Turk worker received a brief training in cognitive reappraisal, and about 1,000 contributed to the study.\n“It took a lot of time to figure out how to teach people these skills and give them examples of what to do in a way that is easily understood in a handful of minutes,” Morris says. “Some of them wanted to sign up afterwards. They were like, ‘Wow, I never knew I had these bugs in my thinking, too.’”\n“What I like about the crowdsourcing idea is that it’s sort of tackling two things in a nice way,” says James Gross, a professor of psychology at Stanford University, who has studied cognitive reappraisal. “One is that reappraisal, although powerful, can break down when you most need it. And so this is saying, ‘Hey, instead of relying on intrinsic regulation, let’s try extrinsic regulation, where we’re going to get some help from other people.’\n“But the second thing is that when you’re depressed, you can withdraw from other people. So now you’ve got this double whammy, where you’ve got a high level of negative emotion, making it more difficult to reappraise, and you’re isolating yourself from other people, which means that you’re not going to be as likely to get extrinsic regulation. What they’ve done is nicely address both of these issues by saying, ‘Hey, we can help with reappraisal, even if you’re feeling a bit depressed, by helping you leverage outside input that you wouldn’t otherwise get. I think this is a promising approach.”", "tags": ["Research", "Mental health", "Depression", "Anxiety", "Brain and cognitive sciences", "Health", "Health care", "Health sciences and technology", "Crowdsourcing", "Media Lab", "School of Architecture + Planning", ""], "title": "Crowdsourced tool for depression"}