{"content": "Sometimes water spreads evenly when it hits a surface; sometimes it beads into tiny droplets. While people have noticed these differences since ancient times, a better understanding of these properties, and new ways of controlling them, may bring important new applications.\nMaterials with a special affinity for water  those it spreads across, maximizing contact  are known as hydrophilic. Those that naturally repel water, causing droplets to form, are known as hydrophobic. Both classes of materials can have a significant impact on the performance of power plants, electronics, airplane wings and desalination plants, among other technologies, says Kripa Varanasi, an associate professor of mechanical engineering at MIT. Improvements in hydrophilic and hydrophobic surfaces could provide ketchup bottles where the condiment just glides right out, glasses that never fog up, or power plants that wring more electricity from a given amount of fuel.\nPhoto courtesy of Rong Xiao and Nenad Miljkovic\nHydrophilic and hydrophobic materials are defined by the geometry of water on a flat surface  specifically, the angle between a droplets edge and the surface underneath it. This is called the contact angle.\nIf the droplet spreads, wetting a large area of the surface, then the contact angle is less than 90 degrees and that surface is considered hydrophilic, or water-loving (from the Greek words for water, hydro, and love, philos). But if the droplet forms a sphere that barely touches the surface  like drops of water on a hot griddle  the contact angle is more than 90 degrees, and the surface is hydrophobic, or water-fearing.\nBut the terminology doesnt stop there: Most current research on hydrophobic and hydrophilic materials is focused on extreme cases  namely, superhydrophobic and superhydrophilic materials. Though the definitions of these terms are less precise, surfaces where tight droplets form a contact angle of more than 160 degrees are considered superhydrophobic. If the droplets are spread out nearly flat, with a contact angle of less than about 20 degrees, the surface is superhydrophilic.\nIn a lot of cases, its the extreme behavior thats useful in engineering, says Evelyn Wang, an associate professor of mechanical engineering at MIT who specializes in superhydrophobic materials. For example, the surfaces of condensers in desalination plants or power plants work best when they are superhydrophobic, so droplets constantly slide off and can be replaced by new ones. Conversely, for applications where water flows over a surface to keep it from overheating, its desirable to have a superhydrophilic material, to assure maximum contact between the water and the surface.\nWhy do these phenomena happen? Its essentially a matter of surface chemistry, which is determined by the characteristics of the materials used. The shape of a surface can also amplify the effects: For example, if a material is hydrophobic, creating nanopatterns on its surface can increase the contact area with a droplet, amplifying the effect and making the surface superhydrophobic. Similarly, nanopatterning of a hydrophilic surface can make it superhydrophilic. (There are exceptions, however, where special kinds of patterning can actually reverse a materials ordinary properties.)\nIt gets more complicated when things are moving  as is often the case in real-world situations. For instance, when a flat surface is tilted, any droplets on it can begin to slide, distorting their shapes. So beyond measurements of static contact angles, a complete understanding of a surfaces properties also requires analysis of how the contact angles at its advancing (front) and receding (back) edges differ when the surface is slanted.\nBecause the natural world is full of hydrophobic and hydrophilic surfaces, the basics of the phenomenon have been known by scientists for at least two centuries. For example, the lotus leaf is a well-known example of a hydrophobic material, protecting the water-dwelling plant from becoming waterlogged. Some species, such as the stenocara beetle of Africas Namib Desert, combine both traits: The insects back and wings have hydrophilic bumps that encourage condensation from fog; these are surrounded by hydrophobic troughs, which collect the resulting droplets and funnel them toward the beetles mouth  allowing it to survive in one of Earths driest places.\nOne area of modern interest in hydrophobic and hydrophilic surfaces has to do with energy efficiency. Superhydrophobic surfaces under development by researchers at MIT and elsewhere could lead to better heat transfer in power-plant condensers, increasing their overall efficiency. Such surfaces could also increase the efficiency of desalination plants.\nNew technologies have also contributed to the field: The ability to create nanopatterned surfaces, with bumps or ridges just a few billionths of a meter across, has enabled a new generation of water-grabbing and water-shedding materials; new high-resolution imaging of surfaces in motion has enabled better understanding of the processes involved.\nResearch enabled by new technologies makes it possible to understand, and manipulate, these behaviors at a level of detail unthinkable a decade or two ago. But sometimes the new methods show how well scientists had things figured out long ago: Its amazing, Varanasi says, that some of the things we can validate now were predicted a century ago.", "tags": ["Hydrophobic materials", "Explained", "Mechanical engineering", "Hydrophilic materials"], "title": "Explained: Hydrophobic and hydrophilic"}