{"content": "Fifteen years ago, MIT professor John Essigmann and colleagues from the University of Washington had a novel idea for an HIV drug. They thought if they could induce the virus to mutate uncontrollably, they could force it to weaken and eventually die out  a strategy that our immune system uses against many viruses. \nThe researchers developed such a drug, which caused HIV to mutate at an enhanced rate, as expected. But it did not eliminate the virus from patients in a small clinical trial reported in 2011. In a new study, however, Essigmann and colleagues have determined the mechanism behind the drugs action, which they believe could help them develop better versions that would destroy the virus more quickly.\nThis type of drug could, they say, help combat the residual virus that remains in the T cells of patients whose disease has been brought into long-term remission by the triple-drug combination typically used to treat HIV. These viruses re-emerge periodically, which is why patients must stay on the drug cocktail indefinitely and are not considered cured.\nThis has really been the biggest problem in HIV, says Essigmann, the William R. and Betsy P. Leitch Professor of Chemistry, Toxicology, and Biological Engineering at MIT. What we would hope is that over a long period of time on this type of therapy, a person would potentially have their latent pool mutated to the extent that it no longer causes active disease.\nIn the new study, which appears in the Proceedings of the National Academy of Sciences (PNAS) the week of July 28, the researchers discovered exactly how the drug, known as KP1212, induces the HIV genome to mutate. The papers lead authors are MIT postdocs Deyu Li, Bogdan Fedeles, and Vipender Singh, along with recent MIT PhD graduate Chunte Sam Peng. Essigmann and Andrei Tokmakoff, a former MIT professor who is now at the University of Chicago, are the papers senior authors.\nToo much mutation\nAfter HIV infects a cell, it rapidly begins making copies of its genetic material. This copying is very error-prone, so the virus mutates swiftly. This usually helps the virus survive by allowing it to evade both the immune system and human-made drugs. However, at a conference in the late 1990s, Essigmann learned from an evolutionary biologist that if the virus could be forced to double its mutation rate, it would no longer be able to produce functional proteins.\nEssigmann and Lawrence Loeb, a professor of biochemistry at the University of Washington, started working together to exploit this idea. Essigmann had been developing compounds that mimic natural nucleotides  the A, C, T, and G letters that form DNA base pairs  but that induce genetic mutations by binding with the wrong partner.   Loeb is an expert on polymerases, the enzymes that string nucleotides together to form DNA or RNA.\nTogether with James Mullins, an immunology professor and HIV expert at the University of Washington, Essigmann and Loeb designed a molecule called 5-hydroxycytosine, described in a 1999 PNAS paper. When given to HIV-infected cells grown in the lab, this molecule was incorporated into the viral genome in place of the natural form of cytosine. Within 25 viral replication cycles, HIV populations in those infected cells collapsed.\nThe researchers then formed a company, Koronis Pharmaceuticals, which developed KP1212, a compound that is 100 times more mutagenic than 5-hydroxycytosine. In a four-month clinical trial of 32 patients, mutations accumulated in the patients viral DNA, but not enough to induce a population crash. The drug was also found to be safe: It did not mutate the patients own DNA, in part because the drug was designed so that human forms of DNA polymerase could not accept it.\nShape-shifting molecules\nIn the new PNAS paper, the researchers used advanced spectroscopy techniques to analyze KP1212s ability to promote tautomerism, a chemical phenomenon that involves the migration of protons among the nitrogen and oxygen atoms on nucleic-acid bases. This allowed the researchers to see that once KP1212 inserts itself into the genome, it can switch among five different shapes, or tautomers. Some of these behave like cytosine, by pairing with guanine. However, some of the tautomers resemble thymine, so they will pair with adenine, introducing mutations.\nThe five molecules are changing shape on a nanosecond timescale, and each shape has a different base-pairing property, so you will see a promiscuity in terms of the bases with which KP1212 pairs, Singh says.\nTo see this shape-shifting, the researchers used NMR and a form of 2-D infrared spectroscopy developed by Tokmakoff. This technology allows scientists to determine the atomic composition and structure of nucleic-acid bases.\nThen, using a genetic tool developed in the Essigmann lab, the researchers determined that KP1212 induces a mutation rate of exactly 10 percent in the HIV genome. Based on these findings, Essigmann estimates that if KP1212 doubles the mutation rate of HIV, it could clear the virus from patients in one to two years.\nHe says that Koronis hopes to run a longer trial of KP1212 and is also interested in developing drugs that would work faster, which could be accomplished by altering some of the chemical features of the molecule and testing whether they speed up the mutation rate.\nThis technology allows you to detect the quantitative contribution of different tautomers to the types and frequencies of mispairing by nucleoside analogs, says Loeb, who was not involved in the new paper. It would allow you to test ahead of time what is making the mispairing occur with the compound that youre using.\nThe paper also identified other factors that scientists could manipulate to improve the drugs performance.\nThere are other variables that are important to calculate the time it would take to eradicate a virus, Fedeles says. That includes the concentration that the drug needs to achieve inside the cell, and the ability of a cell to convert the nucleoside, the molecule without the phosphate, to the triphosphate version, which is the one incorporated by the polymerase.\nWere building up a new strategy that can give us a lot of insights into how to design a new molecule, Li says. Its a new toolset for developing future drugs. Those drugs are not limited to HIV. They could be candidates for dengue fever, or some other viruses such as yellow fever.\nRibavirin, a drug used to treat hepatitis C, and the influenza drug T-705 are also believed to provoke hypermutation in their target viruses. The MIT team also plans to work with Loeb to test the possibility of using similar compounds to force tumor cells to mutate themselves into extinction.\nThe research was funded by the National Institutes of Health, the National Science Foundation, and the MIT Laser Biomedical Research Center.", "tags": ["HIV/AIDS", "Biological engineering", "Bioengineering and biotechnology", "Biology", "Medicine", "Antiviral drugs", "School of Engineering", "Genetics", "Research", ""], "title": "Forced mutations doom HIV"}