{"content": "For Altaeros Energies, a startup launched out of MIT, the sky’s the limit when it comes to wind power.\nFounded by alumni Ben Glass ’08, SM ’10 and Adam Rein MBA ’10, Altaeros has developed the world’s first commercial airborne wind turbine, which uses a helium-filled shell to float as high as a skyscraper and capture the stronger, steadier winds available at that altitude.\nProven to produce double the energy of similarly sized tower-mounted turbines, the system, called Buoyant Air Turbine (or BAT), is now readying for commercial deployment in rural Alaska.   \nSurrounded by a circular, 35-foot-long inflatable shell made of the same heavy-duty fabric used in blimps and sails, the BAT hovers 1,000 to 2,000 feet above ground, where winds blow five to eight times stronger, as well as more consistently, than winds at tower level (roughly 100 to 300 feet).\nThree tethers connect the BAT to a rotating ground station, automatically adjusting its altitude to obtain the strongest possible winds. Power generated by the turbine travels down one of the tethers to the ground station before being passed along to microgrids.\n“Think of it as a reverse crane,” says Glass, who invented the core BAT technology. “A crane has a nice stationary component, and an upper platform that rotates in order to suspend things down. We’re doing the same thing, but suspending things up.”\nNext year, the BAT will test its ability to power microgrids at a site south of Fairbanks, Alaska, in an 18-month trial funded by the Alaska Energy Authority. People in rural Alaska rely on gas and diesel generators for power, paying upward of $1 per kilowatt-hour for electricity. The BAT, which has a capacity of 30 kilowatts, aims to drop that kilowatt-hour cost down to roughly 18 cents, the co-founders say.\nBut despite its efficiency, the BAT is not designed to replace conventional tower-mounted turbines, Rein says. Instead, its purpose is to bring wind power to remote, off-grid areas where towers aren’t practically or economically feasible.\nConventional turbine construction, for instance, requires tons of concrete and the use of cranes, which can be difficult to maneuver around certain sites. The modular BAT, Rein says, packs into two midsize shipping containers for transport “and can just be inflated out and self-lift into the air for installation.”\nTarget sites include areas where large diesel generators provide power — such as military bases and industrial sites — as well as island and rural communities in Hawaii, northern Canada, India, Brazil, and parts of Australia. The BAT could also provide power to places blacked out by natural disasters, as well as at amusement parks, festivals, and sports venues.\n“It’s really about expanding wind energy to all those places on the fringes where it doesn’t really work today, and expanding the amount of wind power that’s able to be deployed globally,” Rein says.\nAerostat innovation\nMuch of the BAT’s innovation lies in its complete autonomy, Glass says. Such aerostats usually require full-time ground crews to deploy, land, and adjust. But the BAT automatically adjusts to optimal wind speeds and self-docks in case of emergencies, eliminating the need for manual labor.\n“When winds are low, typically we want to go as high as possible — because, generally speaking, the higher you are, the stronger the winds,” Glass explains. “But if winds get too high, above the maximum [capacity] of the turbine, there’s no reason to operate in those very strong winds, so we can bring it down, where it operates at rated power, but is not subject to very strong winds.”\nTo guide its positioning, the BAT is equipped with anemometers installed in the airborne unit and ground station. When the anemometers detect optimal wind speed, a custom algorithm adjusts the system’s tethers to extend or contract, while the base rotates into the wind. In rare instances, when wind conditions are optimal on the ground, the system will self-dock, but continue rotating.\nDesigned to handle winds of more than 100 mph, the system is unaffected by rain or snow. However, should the weather get too inclement, or should a tether break loose, the BAT’s secondary grounding tether — which protects the system’s electronics from lightning strikes — will self-dock.\nBecause the BAT is an advanced aerostat platform, Glass says, customers can use it to lift additional “payloads,” such as weather monitoring and surveillance equipment.\nBut perhaps the most logical added “payload,” Glass says, is Wi-Fi technology: “If you have a remote village, for instance,” he says, “you can put a Wi-Fi unit up, outside the village, and you’re much higher than you’d get with a traditional tower. That would allow you to cover six to eight times the area you would with a tower.”\nPrototype to product\nGlass first conceived of the BAT while working at MIT toward his master’s degree in aeronautics and astronautics. Harboring an interest in wind turbine design, and knowing that traditional towers could never reach high-altitude winds, he designed the BAT in his free time, receiving technical guidance from Institute Professor Sheila Widnall and other faculty.\nSoon, he’d bring his concept to 15.366 (Energy Ventures), a class at the MIT Sloan School of Management where engineering, policy, and business students build startups around clean tech ideas. At the time, Rein, who had done independent research on clean energy, was an MBA student and teacher’s assistant for the class who helped Glass flesh out an initial business model.\nThe duo — along with Harvard University grad student Alain Goubau and investor Alex Rohde, then an Alfred P. Sloan Fellow — soon formed Altaeros. They solicited advice from seasoned entrepreneurs at MIT’s Venture Mentoring Service (VMS) — “our first advisory board,” Rein says — who steered the startup toward rapid prototyping by using low-cost, off-the-shelf materials.\nFor their first power-producing prototype, they bought a small, reliable wind-turbine rotor, “and cut off some metal in the back that was dead weight and built a composite nacelle to hold our custom electronics and control systems,” Rein says.\nIn 2012, Altaeros, after just two years of refining, proved the BAT’s efficiency at 300 feet above ground at a former Air Force base in Maine, where the company still assembles and tests the system. They did so again last August, at 500 feet in 45-mph winds.  \nAltaeros remains headquartered in cleantech incubator Greentown Labs (which Rein co-founded), in Somerville, Mass. — where its first rotor is proudly displayed near the entrance, along with enlarged photos of the first trial run. At Greentown, employees engage in computer modeling and design, build electronics and circuit boards, develop algorithms, and test winches and cables. \nLooking back, Glass credits his undergraduate years on MIT’s Solar Electrical Vehicle Team — a student organization that builds and races solar cars for competition — with giving him the experience and motivation to bring the BAT from concept to reality.\n“Just being able to see a project from design and analysis stage through building, testing, and operating was valuable,” he says. “It’s also something that helped in leading a technical team at Altaeros, to essentially do the same thing on a bigger scale.”\nFor now, Altaeros is focused on finalizing the commercial product for Alaska and, eventually, deploying the technology worldwide. “To take the system from concept to actual prototype has been exciting,” Glass says. “But the next step is making the prototype a commercial product and really seeing its real-world performance.”", "tags": ["Startups", "Innovation and Entrepreneurship (I&E)", "Alumni/ae", "Wind", "wind energy", "Energy", "Renewable energy", "MIT Sloan School of Management", "Aeronautical and astronautical engineering"], "title": "High-flying turbine produces more power"}