{"content": "Eating a slice of chocolate cake or spending time with a friend usually stimulates positive feelings, while getting in a car accident or anticipating a difficult exam is more likely to generate a fearful or anxious response.\nAn almond-shaped brain structure called the amygdala is believed to be responsible for assigning these emotional reactions. Neuroscientists from MIT’s Picower Institute for Learning and Memory have now identified two populations of neurons in the amygdala that process positive and negative emotions. These neurons then relay the information to other brain regions that initiate the appropriate behavioral response.\nThe study, which appears in the April 29 issue of Nature, represents a significant step in understanding how the brain assigns emotions to different experiences, says senior study author Kay Tye, the Whitehead Career Development Assistant Professor in the Department of Brain and Cognitive Sciences.\n“How do we tell if something is good or bad? Even though that seems like a very simple question, we really don’t know how that process works,” Tye says. “This study tells us that streams of information are hard-wired and are separated into good and bad at the level of the amygdala.”\nThe findings could also help scientists to better understand how mental illnesses such as depression arise, she says. Many psychiatric symptoms may reflect impairments in emotional processing. For example, people who are depressed do not find positive experiences rewarding, and people who suffer from addiction are not deterred by the negative outcomes of their behavior.\nGraduate student Praneeth Namburi and postdoc Anna Beyeler are the paper’s lead authors.\nThe good, the bad, and the amygdala\nFor many years neuroscientists viewed the amygdala — and in particular, a subregion known as the basolateral amygdala — as a processing center for fear. However, more recent studies, including work that Tye did as a graduate student at the University of California at San Francisco, have highlighted the importance of the amygdala in processing reward.\nThose findings raised the question of how the same structure could respond to both positive and negative inputs and initiate the appropriate behavioral response. The neurons of the basolateral amygdala are intermingled, making it difficult to distinguish which populations might be involved in different functions.\nTye and colleagues suspected they might be able to distinguish populations of neurons that respond to different emotions based on their targets elsewhere in the brain. Previous studies had suggested that some of these neurons project to the nucleus accumbens, which plays a role in reward learning, while others send information to another part of the amygdala known as the centromedial amygdala.\nTo identify these populations, the researchers delivered green and red fluorescent microspheres called retrobeads to the target cells in the nucleus accumbens and centromedial amygdala, respectively. These spheres traveled backwards until they reached the neurons of the basolateral amygdala, clearly marking two distinct populations.\nAfter labeling these neurons, the researchers analyzed amygdala activity as the mice learned either a fear-conditioning task or a reward task. In the fear-conditioning task, the mice learned to associate a tone with a foot shock, and in the reward task the tone was paired with a drink of sugary water.\nThe next day, the researchers measured the strength of the connections coming into the two populations, which carry sensory information to the amygdala. They found that basolateral amygdala neurons that connect to the nucleus accumbens receive stronger input after reward learning, but their inputs are weakened after fear learning. Neurons that connect to the centromedial amygdala show the opposite response.\nThe results suggest that these two populations essentially function as a gate for sensory information coming into the amygdala, Namburi says. “There are sensory inputs coming in to either of these populations, and once learning happens, you’re shifting the flood onto one population or the other,” he says.\nThe researchers then found that by shutting down the pathway to the fear circuit, they not only impaired fear learning, but also enhanced reward learning. \n“This was exciting because it suggests that these populations engage in a push-pull interaction with each other, which makes sense as seeking rewards and avoiding threats are often behaviors that present opposing forces,” Tye says. “Just as you might expect someone to lose their appetite if gunshots were fired, the activation of the fear circuit could suppress reward-related behaviors.”\nSheena Josselyn, an associate professor of psychology and physiology at the University of Toronto, describes the paper as “a huge advance in our understanding of how the brain processes different emotions.”\n“Everyone knows that we can learn about both positive and negative experiences, but it has never been shown how one structure can contribute to encoding two diametrically opposed emotional outcomes,” says Josselyn, who was not involved in the research. “This work showed that where each cell projects determines whether it encodes a positive or a negative memory. Just looking at the cell doesn’t reveal its identity, one must consider the cell in the context of a broader circuit.”\nDistinguishing traits\nOnce the researchers defined the functions of each cell population, they set out to identify other distinguishing characteristics. They found only minor differences in shape and in the electrophysiological properties of the neurons, but they did detect some intriguing differences in gene expression. Some of the genes that were more active in one cell type than the other encode receptors that sit on cell surfaces and bind to incoming neurotransmitters, which help transmit sensory information to the amygdala.\nThe researchers are particularly interested in one of these receptors, which interacts with a small protein called neurotensin. This protein helps to regulate the cells’ response to glutamate, one of the major neurotransmitters required to strengthen connections between neurons. In follow-up studies, they are now investigating the role neurotensin may play in reward- and fear-learning in the amydgala.\n“This represents a new paradigm for therapeutic development,” Tye says.   “‘Circuit-based drug discovery’ relies on first identifying how different components of the circuit work and then identifying what targets might control them.”\nThe research was funded by the National Institute of Mental Health, the National Institute of Diabetes and Digestive and Kidney Diseases, the JPB Foundation, the Brain & Behavior Research Foundation, the Esther A. and Joseph Klingenstein Fund, the Whitehall Foundation, and the Alfred P. Sloan Foundation.", "tags": ["Brain and cognitive sciences", "Neuroscience", "Learning", "Memory", "Mental health", "Picower Institute", "Research", "School of Science", ""], "title": "How the brain tells good from bad"}