{"content": "Qing Hu, the MIT Distinguished Professor in Electrical Engineering and Computer Science and principal investigator in the Research Laboratory of Electronics (RLE) has been selected by the board of directors of the Optical Society (OSA) as the 2015 recipient of the Nick Holonyak, Jr. Award. He is recognized for his pioneering contribution to high-performance terahertz (THz) quantum-cascade lasers and their applications in imaging and sensing.\nThe Nick Holonyak Jr. Award was established in 1997 in honor of Nick Holonyak, Jr., who has made distinguished contributions to the field of optics through the development of semiconductor-based light emitting diodes and semiconductor lasers.\nHu has made significant contributions to physics and device applications over a broad electromagnetic spectrum, from millimeter-wave, through terahertz, to infrared frequencies. His research has involved technology development for detectors and sources, as well as system-level imaging and sensing applications. Among those contributions, the most distinctive is his development of high-performance THz quantum cascade lasers. This breakthrough has already found applications in sensing and real‐time THz imaging, which was also pioneered by his group, the Millimeter-wave and Terahertz Devices Group. His work, reported in the journal Nature Physics, on achieving sold-state terahertz lasers operable at closer to room temperature was recognized in late 2010 for bringing the possibility of making solid-state lasers as a promising means of detecting trace explosives much closer to reality.  \nHu is a fellow of the OSA, of the American Physical Society, of IEEE, and of the American Association for the Advancement of Science. He is the recipient of the 2012 IEEE Photonics Society William Streifer Scientific Achievement Award. He has been an associate editor of Applied Physics Letters since 2006, and was the co-chair of the 2006 International Workshop on Quantum Cascade Lasers.\nIn addition to his research, Hu has also made important contributions to the MIT Department of Electrical Engineering and Computer Science (EECS) in service and teaching. He has served on the EECS faculty search committee during 2008-2011, the EECS Accreditation Board for Engineering and Technology committee during 2012-2013, and the personnel committee since 2012. He has taught a broad range of courses, including 6.003 (Signals and Systems), 6.012 (Microelectronic Devices and Circuits), 6.013 / 6.014 (Electromagnetics), 6.017 (Quantum Mechanics, prior to 1995), and 6.730 and 6.732 (Solid-state Physics).", "tags": ["Awards, honors and fellowships", "Faculty", "Electrical Engineering & Computer Science (eecs)", "Research Laboratory of Electronics", "Optics", "Imaging", "School of Engineering", ""], "title": "Hu selected for 2015 Holonyak, Jr. Award"}