{"content": "n findings that may lead to new treatments for cognitive disorders, researchers at MITs Picower Institute for Learning and Memory zero in on how the brain forms memories of what has been seen.\nIn a paper appearing this week in the online edition of Nature Neuroscience, a research team led by Mark Bear, the Picower Professor of Neuroscience, showed that dramatic changes occur in the primary visual cortex when mice learn to distinguish novel from familiar visual stimuli. Manipulations that prevented the changes in visual cortex also blocked memory formation.\nImpairments in detecting and recognizing familiar visual elements and patterns are features of a number of neuropsychiatric disorders, including autism and schizophrenia. With these new findings, we now have an opportunity to investigate how gene mutations that cause or increase the risk for these disorders disrupt the mechanisms of visual recognition memory, says Bear, a Howard Hughes Medical Institute investigator. We anticipate that this knowledge will suggest entirely novel approaches to treating these diseases.\nTo understand the physical basis of memory, researchers seek to identify where and how the brain changes as learning occurs  something that has been very difficult to achieve.\nThe studys lead author, Picower Institute research scientist Samuel F. Cooke, working with postdoctoral fellows Robert W. Komorowski and Jeffrey Gavornik and graduate student Eitan S. Kaplan, showed that mice move to investigate a visual stimulus that has never before been experienced, but stop moving when the same stimulus becomes familiar. They discovered that as familiarity was learned, synaptic transmission was changed in the primary visual cortex. Preventing or reversing this synaptic plasticity in visual cortex left the animals unable to distinguish familiar and novel visual stimuli.\nPreviously, the primary visual cortex was seen as a first responder to visual stimuli that quickly passes information along to higher-order brain regions for interpretation and memory storage. The study points to the visual cortex as a tool of learning and memory in its own right, capable of storing simple but fundamentally important memories, Cooke says. Our work provides great hope for the future as it suggests we may have the chance to directly observe neurons undergo lasting changes as a very simple and experimentally constrained memory is formed.\nBear anticipates that the results will surprise neuroscientists. We find that, contrary to the dogma that the primary visual cortex is relatively immutable in adults, a form of visual experience induces synaptic modifications in this area, and these modifications are necessary for a type of visual recognition memory.\nThis work was supported by the Howard Hughes Medical Institute, the National Eye Institute, the Picower Institute Innovation Fund and the Picower Neurological Disorder Research Fund. ", "tags": ["Research", "Brain and cognitive sciences", "Neuroscience", "Picower Institute for Learning and Memory", "Behavior", "Psychiatric disorders", "Autism", "Schizophrenia", "Mental health", "School of Science"], "title": "MIT researchers find where visual memories are made"}