{"content": "Solar energy holds the best potential for meeting humanity’s future long-term energy needs while cutting greenhouse gas emissions — but to realize this potential will require increased emphasis on developing lower-cost technologies and more effective deployment policy, says a comprehensive new study, titled “The Future of Solar Energy,” released today by the MIT Energy Initiative (MITEI).\n“Our objective has been to assess solar energy’s current and potential competitive position and to identify changes in U.S. government policies that could more efficiently and effectively support its massive deployment over the long term, which we view as necessary,” says MITEI Director Robert Armstrong, the Chevron Professor in Chemical Engineering at MIT.\nThe study’s chair, Richard Schmalensee, the Howard W. Johnson Professor Emeritus of Economics and Management at the MIT Sloan School of Management, adds, “What the study shows is that our focus needs to shift toward new technologies and policies that have the potential to make solar a compelling economic option.”\nThe study group is presenting its findings to lawmakers and senior administration officials this week in Washington.\n“The Future of Solar Energy” reflects on the technical, commercial, and policy dimensions of solar energy today and makes recommendations to policymakers regarding more effective federal and state support for research and development, technology demonstration, and solar deployment.\nAmong its major themes is the need to prepare our electricity systems, both technically and from a regulatory standpoint, for very large-scale deployment of solar generation — which tends to vary unpredictably throughout the day. To this end, the study emphasizes the need for federal research and development support to advance low-cost, large-scale electricity storage technologies.\nThe analysis finds that today’s federal and state subsidy programs designed to encourage investment in solar systems should be reconsidered, to increase their cost-effectiveness, with greater emphasis on rewarding production of solar energy. \nThe group also recommends that state renewable portfolio standards, which are designed to increase generation of electricity from renewable resources, be brought under a unified national program that would reduce the cost of meeting set mandates by allowing unrestricted interstate trading of credits.\nThe study concludes by pointing to the urgent need for an ambitious and innovative approach to technology development, with federal research and development investment focused on new technologies and systems with the potential to deliver transformative system cost reductions.\nThe MIT “Future of …” studies are a series of multidisciplinary reports that examine the role various energy sources could play in meeting future energy demand under carbon dioxide emissions constraints. These comprehensive reports are written by multidisciplinary teams of MIT researchers. The research is informed by an external advisory committee.", "tags": ["Research", "MITEI", "School of Engineering", "Sloan School of Management", "Chemical engineering", "Energy", "Alternative energy", "Solar", "Policy", "", ""], "title": "MITEI releases report on the future of solar energy"}