{"content": "The phenomenon of false memory has been well-documented: In many court cases, defendants have been found guilty based on testimony from witnesses and victims who were sure of their recollections, but DNA evidence later overturned the conviction.\nIn a step toward understanding how these faulty memories arise, MIT neuroscientists have shown that they can plant false memories in the brains of mice. They also found that many of the neurological traces of these memories are identical in nature to those of authentic memories.\n“Whether it’s a false or genuine memory, the brain’s neural mechanism underlying the recall of the memory is the same,” says Susumu Tonegawa, the Picower Professor of Biology and Neuroscience and senior author of a paper describing the findings in the July 25 edition of Science.\nThe study also provides further evidence that memories are stored in networks of neurons that form memory traces for each experience we have — a phenomenon that Tonegawa’s lab first demonstrated last year.\nNeuroscientists have long sought the location of these memory traces, also called engrams. In the pair of studies, Tonegawa and colleagues at MIT’s Picower Institute for Learning and Memory showed that they could identify the cells that make up part of an engram for a specific memory and reactivate it using a technology called optogenetics.\nLead authors of the paper are graduate student Steve Ramirez and research scientist Xu Liu. Other authors are technical assistant Pei-Ann Lin, research scientist Junghyup Suh, and postdocs Michele Pignatelli, Roger Redondo and Tomas Ryan.\nSeeking the engram\nEpisodic memories — memories of experiences — are made of associations of several elements, including objects, space and time. These associations are encoded by chemical and physical changes in neurons, as well as by modifications to the connections between the neurons.\nWhere these engrams reside in the brain has been a longstanding question in neuroscience. “Is the information spread out in various parts of the brain, or is there a particular area of the brain in which this type of memory is stored? This has been a very fundamental question,” Tonegawa says.\nIn the 1940s, Canadian neurosurgeon Wilder Penfield suggested that episodic memories are located in the brain’s temporal lobe. When Penfield electrically stimulated cells in the temporal lobes of patients who were about to undergo surgery to treat epileptic seizures, the patients reported that specific memories popped into mind. Later studies of the amnesiac patient known as “H.M.” confirmed that the temporal lobe, including the area known as the hippocampus, is critical for forming episodic memories.\nHowever, these studies did not prove that engrams are actually stored in the hippocampus, Tonegawa says. To make that case, scientists needed to show that activating specific groups of hippocampal cells is sufficient to produce and recall memories.\nTo achieve that, Tonegawa’s lab turned to optogenetics, a new technology that allows cells to be selectively turned on or off using light.\nFor this pair of studies, the researchers engineered mouse hippocampal cells to express the gene for channelrhodopsin, a protein that activates neurons when stimulated by light. They also modified the gene so that channelrhodopsin would be produced whenever the c-fos gene, necessary for memory formation, was turned on.\nIn last year’s study, the researchers conditioned these mice to fear a particular chamber by delivering a mild electric shock. As this memory was formed, the c-fos gene was turned on, along with the engineered channelrhodopsin gene. This way, cells encoding the memory trace were “labeled” with light-sensitive proteins.\nThe next day, when the mice were put in a different chamber they had never seen before, they behaved normally. However, when the researchers delivered a pulse of light to the hippocampus, stimulating the memory cells labeled with channelrhodopsin, the mice froze in fear as the previous day’s memory was reactivated.\n“Compared to most studies that treat the brain as a black box while trying to access it from the outside in, this is like we are trying to study the brain from the inside out,” Liu says. “The technology we developed for this study allows us to fine-dissect and even potentially tinker with the memory process by directly controlling the brain cells.”\nIncepting false memories\nThat is exactly what the researchers did in the new study — exploring whether they could use these reactivated engrams to plant false memories in the mice’s brains.\nFirst, the researchers placed the mice in a novel chamber, A, but did not deliver any shocks. As the mice explored this chamber, their memory cells were labeled with channelrhodopsin. The next day, the mice were placed in a second, very different chamber, B. After a while, the mice were given a mild foot shock. At the same instant, the researchers used light to activate the cells encoding the memory of chamber A.\nOn the third day, the mice were placed back into chamber A, where they now froze in fear, even though they had never been shocked there. A false memory had been incepted: The mice feared the memory of chamber A because when the shock was given in chamber B, they were reliving the memory of being in chamber A.\nMoreover, that false memory appeared to compete with a genuine memory of chamber B, the researchers found. These mice also froze when placed in chamber B, but not as much as mice that had received a shock in chamber B without having the chamber A memory activated.\nThe researchers then showed that immediately after recall of the false memory, levels of neural activity were also elevated in the amygdala, a fear center in the brain that receives memory information from the hippocampus, just as they are when the mice recall a genuine memory.\nThese two papers represent a major step forward in memory research, says Howard Eichenbaum, a professor of psychology and director of Boston University’s Center for Memory and Brain.\n“They identified a neural network associated with experience in an environment, attached a fear association with it, then reactivated the network to show that it supports memory expression. That, to me, shows for the first time a true functional engram,” says Eichenbaum, who was not part of the research team.\nThe MIT team is now planning further studies of how memories can be distorted in the brain.\n“Now that we can reactivate and change the contents of memories in the brain, we can begin asking questions that were once the realm of philosophy,” Ramirez says. “Are there multiple conditions that lead to the formation of false memories? Can false memories for both pleasurable and aversive events be artificially created? What about false memories for more than just contexts — false memories for objects, food or other mice? These are the once seemingly sci-fi questions that can now be experimentally tackled in the lab.”\nThe research was funded by the RIKEN Brain Science Institute.", "tags": ["Brain and cognitive sciences", "Engram", "False memory", "Inception", "Memory", "Memory trace", "Neuroscience", "Picower Institute for Learning and Memory", "Research"], "title": "Neuroscientists plant false memories in the brain"}