{"content": "Today’s 3-D printers, in which devices rather like inkjet-printer nozzles deposit materials in layers to build up physical objects, are a great tool for designers building prototypes or small companies with limited product runs.\nBut they take a long time to produce objects that are more than a couple of centimeters in height, and many researchers believe that they’ll realize their full potential only when they can generate sheets of patterned materials that will automatically warp themselves into larger, more complex shapes.\nIn the latest issue of the journal Scientific Reports, a team of researchers at MIT and the companies Autodesk and Stratasys describe a new process for designing and manufacturing such “programmable matter” that could make it more versatile. Whereas much prior work — at MIT and elsewhere — concentrated on materials that self-fold, the new procedure yields materials that also self-stretch.\n“If a structure is going to change, and curvature appears — like going from a flat domain to something that has effective curvature, such as a mountain — the area is going to change,” says Dan Raviv, a postdoc at the MIT Media Laboratory and lead author on the new paper. “There’s going to be stretching. Until now, people just considered bending, which leaves the area and lengths the same. Or they did some stretching, but without the ability to control or pre-program it. Now we need to develop new sets of tools to do both.”\nRaviv is a member of the Media Lab’s Camera Culture group, which is led by associate professor of media arts and sciences Ramesh Raskar and specializes in computational photography. That may sound like a far cry from self-folding materials, but Raviv says that his work focused on geometric interpretations of visual data. The mathematical framework for mapping points of color in an image onto multiple hypothetical 3-D models of the underlying scene is very similar to the framework for mapping points on the surface of a self-deforming material onto their final locations.\nGetting physical\nRaviv, Raskar, graduate student Achuta Kadambi, and Boxin Shi, another postdoc in Raskar’s group, had been invited to collaborate on the problem of self-assembling printable materials at a presentation last year by Skylar Tibbits, a research scientist in MIT's Department of Architecture who heads the MIT Self-Assembly Lab. Tibbits favors the term “4-D printing” for his lab’s work, where the fourth dimension is the time it takes devices to self-assemble.\nThe Camera Culture researchers developed algorithms that could determine how much parts of an arbitrary 3-D object needed to stretch to accommodate its deformation into another shape. But figuring out how to physically realize that deformation fell to Tibbits’ group.\nMuch prior work on self-folding materials has involved laminates: A 3-D printer or laser cutter would produce patterned sheets of different materials, which researchers would then stick together by hand. One of the materials would bend when heated or immersed in water; the other would hold some parts of the sheet rigid.\nBut Tibbits was committed to the idea of a truly printable material — one that was ready to go when it came out of the printer. He had been collaborating with researchers at Stratasys, a company that manufactures 3-D printers, who had developed a polymer that expands when it absorbs water. Stratasys printers can deposit multiple polymers in each layer of a 3-D-printed object, and Tibbits’ group had come up with designs that used combinations of polymers to produce materials that self-folded upon immersion.\nHome stretch\nTogether with Carrie McKnelly, a graduate student, and Athina Papadopoulou, a research specialist — both in the Department of Architecture — Tibbits came up with a simple but elegant design for a “linear actuator,” or a component that would enable segments of his printed materials to stretch. In the component, two polymer disks are connected to each other by two bowed strips of a composite polymer. In profile, the component looks like the insignia of the comic-book superhero the Green Lantern.\nThe inner edges of the bowed strips are made from the expanding polymer, and when they absorb water, the strips straighten out.\nTibbits’ group experimented with the relative thicknesses of the expanding and rigid layers until they had established a relationship between the diameter of the ellipse produced by the bowed strips and the degree of expansion. They also determined how to striate the disks at the ends of the strips with indentations and layers of expanding polymer so that they would bend in the right directions to accommodate the curvature of the material’s expanding regions.\nOnce they’d established the performance characteristics of their components, the MIT researchers collaborated with colleagues at Autodesk, a manufacturer of computer-aided-design software, to develop a simulation program that would determine whether devices made from their design specifications would self-assemble as expected. The Autodesk researchers, like those from Stratasys, are co-authors on the new paper.\n“It is unclear whether the strategy of 3-D printing followed by immersion in water is a technologically viable pathway to creating responsive architectures,” says Jennifer Lewis, a professor in Harvard University’s School of Engineering and Applied Sciences. “Nevertheless, this is an elegant example of 4-D printing.”", "tags": ["Research", "printing", "3-D", "School of Architecture + Planning", "Media Lab", "Architecture", "", ""], "title": "New horizons for self-assembling materials"}