{"content": "In 1755, a major earthquake shook the Boston area, toppling chimneys and inspiring sermons and poems about the wrath of God, such as \"Earthquakes the Works of God and Tokens of his Just Displeasure\" and \"The Duty of a People, Under Dark Providences.\" The quake, whose epicenter was about 25 miles from Massachusetts' Cape Anne and 50 miles out to sea from Boston, measured an estimated 6.0 to 6.3 on the Richter scale. Since then, Bostonians have not had to worry much about the ground beneath them. In fact, preparing for earthquakes is probably near the bottom of the city’s to do list. But what if another major earthquake were to strike? According to SUTD-MIT postdoctoral fellow Ornella Iuorio, it would not be good.\nIuorio, who hails from earthquake-prone Italy, is spending one year at MIT, followed by a second year at the Singapore University of Technology and Design (SUTD), carrying out collaborative research with MIT Professor John Ochsendorf and SUTD professor Jeffrey Huang. For a large part of her career, Iuorio has focused on designing resilient new buildings that can withstand seismic events. Now, she is turning her attention to making historic buildings and neighborhoods earthquake-safe, with the ultimate aim of developing a tool that urban planners could use to decide which retrofit options make the most sense in a particular area.\nHer project, \"Smart Retrofit for Resilient Historic Cities,\" is part of a comprehensive case study of Boston’s historic Back Bay neighborhood. Other researchers, including professor and MIT-SUTD International Design Center director John Fernandez and visiting scholar Nino Barbalace, have already begun studying Back Bay with an eye toward environmental retrofits. Therefore, Iuorio and Ochsendorf decided to complement that work by focusing on structural aspects.\nAlthough it may seem unusual to examine earthquake resilience in an area seldom struck by earthquakes, Back Bay is an excellent site for the study. Like many historically valuable and beautiful urban neighborhoods, it is also extremely vulnerable to damage. Back Bay homes were primarily constructed of unreinforced masonry, which crumbles fairly easily. Furthermore, the entire development sits on what was once a mud flat, which was filled over the course of the 19th century. Although filled land is solid enough to build on, it still contains water. When the earth moves, it tends to liquefy. The fill layer can also settle and sink, exposing foundation posts to air and leaving them vulnerable to dry rot. In 1755, Boston’s population was much smaller, and Back Bay did not exist, so the Cape Anne earthquake caused only minor damage. It is estimated that an earthquake of similar magnitude today would cost billions of dollars and hundreds or even thousands of lives.\nIf planners hope to mitigate destruction in a place like Back Bay, the challenge, as Iuorio sees it, is to balance the various, often competing, factors involved, including safety, economic cost, environmental cost of the retrofit materials, and the historical value of the buildings. There are structural retrofits that can be easily applied, such as chains or fibrous mesh to hold the walls together as a unit. However, such retrofits can be costly, and may destroy some of the historical character of a neighborhood like Back Bay. Iuorio’s model would generate multiple solutions for structural retrofitting depending on the relative weight given to each of the factors. From the various options, city planners could choose the one that makes the most sense for the area in question.\nThe first phase of this project is a detailed classification of the thousand or so buildings that make up the neighborhood. Iuorio has been combing through old records and conducting on-site inspections to determine the type of construction used in each building, and to analyze potential vulnerabilities. Once this work is complete, she can begin to generate her model of retrofit options. In doing so, she says, it is important to consider the whole neighborhood, not just the individual structures. Since the buildings are directly adjacent, they act as a unit. If one begins to fold, those next to it will be affected as well. Therefore, not all retrofits would be equally effective. Reinforcing a structure at the end of a block, for example, may have more of an impact than reinforcing one in the middle of a row. Her model would make optimal suggestions based on the whole picture.\nWill the mayor’s office be clamoring for the results and revising the city’s budget to allocate money for seismic retrofits? That’s unlikely, given the low probability of another major earthquake in the near future and more pressing concerns like snow removal and rising sea levels. However, the data provided by Iuorio’s study of the Back Bay neighborhood and the model she creates could serve other cities seeking to make their historic structures safer. In her second year of research, when she travels to Singapore, she may also apply the principles of her process on a larger scale, analyzing not just one neighborhood, but whole cities.\nScientists have learned a lot about why earthquakes occur since the Cape Anne event in the 18th century, but they still cannot predict when or where the next big quake may happen. Planners must make difficult decisions about how far to go in preparing for the unknown, and Iuorio is trying to make that process a little bit easier.  ", "tags": ["Architecture", "Earthquakes", "Urban studies and planning", "Research", "School of Architecture + Planning", "Singapore University of Technology and Design (SUTD)", "Singapore-MIT", "Seismic data", "Cambridge, Boston and region"], "title": "Preparing Boston for the \"big one\""}