{"content": "Financial innovation is supposed to reduce risk — in theory, at least. Yes, new financial instruments based on the housing market helped cause the financial crisis of 2008. But in the abstract, those same instruments have the potential to spread risk more evenly throughout the marketplace by making it possible to trade debt more extensively, rather than having it concentrated in a relatively few hands.\nNow a paper published by MIT economist Alp Simsek makes the case that even in theory, financial innovation does not lower portfolio risk. Instead, it raises portfolio risks by creating situations in which parties sit on opposing sides of deep disagreements about the value of certain investments.\n“In a world in which investors have different views, new securities won’t necessarily reduce risks,” says Simsek, an assistant professor in MIT’s Department of Economics. “People bet on their views. And betting is inherently a risk-increasing activity.”\nIn a paper published this month in the Quarterly Journal of Economics, titled “Speculation and Risk Sharing with New Financial Assets,” Simsek details why he thinks this is the case. The risk in portfolios, he argues, needs to be divided into two categories: the kind of risk that is simply inherent in any real-world investment, and a second type he calls “speculative variance,” which applies precisely to new financial instruments designed to generate bets based on opposing worldviews.\nTo be clear, Simsek notes, financial innovation may have other benefits — it may spread information around world markets, for instance — but it is not going to lead to lower risks for investors as a whole.\n“Financial innovation might be good for other reasons, but this general kind of belief that it reduces the risks in the economy is not right,” Simsek says. “And I want people to realize that.”\nWe beg to differ\nTo see why financial innovation is supposed to reduce risk — and why Simsek argues that it does not — consider the family of instruments based around home mortgages. These include the mortgage-backed security, which is a bundle of mortgages sold as a bond; the collateralized debt obligation, which is a bundle of mortgage-backed securities; and the credit default swap, which is basically insurance on these kinds of debt.\nIn theory, wrapping a bunch of mortgages into a bond and selling it on the markets spreads risk around and could lead to lower mortgage rates. Since the bank or lending institution no longer has to hold all the loans, it is both less vulnerable and — not having to worry as much about defaults — may be in a better position to loan at lower rates.\nMoreover, these kinds of financial instruments separate home loans into distinct tranches, based on apparent risk — meaning that hedge funds with high risk tolerance could acquire the higher-paying, riskier loans, and pension funds could acquire the seemingly safer tranches.\nAny investment in mortgages will contain a certain amount of risk, since no one can be completely certain what the future holds for the housing market. But now consider what occurs when the credit default swap enters the mix. This is essentially a side bet between parties — such as banks and reinsurance companies — about the future of the housing market, and it will produce a winner and a loser. The wager represents precisely the kind of speculative variance, in Simsek’s term, that stems from a “belief disagreement.”\nAs it happens, Simsek believes that a closer analysis of the standard tool used to evaluate portfolio risk, the capital-asset pricing model (CAPM) in use since the 1960s, reveals that this kind of distinction is inherent in its equations.\n“If you do the math, [portfolio risk] naturally breaks down into two components,” Simsek says — the inherent risk of investing, and speculative variance. His current paper is thus a mathematical demonstration of the idea that, using this widely accepted mode of analyzing risk, “as you increase assets, this speculative part always goes up,” as he explains, and that “when disagreements are large enough, this second effect is dominant and you end up increasing the average [portfolio risks] as well.”\nModel research\nTo be sure, Simsek’s conclusion is based on a model. However, modeling is a significant part of economics; the right model can help describe and illuminate complex realities.  \n“You build models, and if you’re lucky enough, the model speaks back,” Simsek says.\nMoreover, the disastrous results of financial innovations related to the housing market in recent years suggested to him that some rethinking of risk theory was in order. “What happened at the time seemed inconsistent to me with what we learned in finance courses,” says Simsek, referring to the investment bubble that sank prominent Wall Street firms and required a huge government bailout.\nThat is not to say that housing or the bond market are the only areas where speculative variance can be found; as Simsek points out, commodities markets, with their many futures contracts, are an obvious place to find bets based on belief disagreement and expressed through innovative financial tools. \nOther economists are impressed by the paper. “He goes deep and he’s very careful and rigorous and clear,” says Darrell Duffie, a professor of finance at Stanford University’s Graduate School of Business, who commented on the paper at this year’s meeting of the American Economic Association.\nAs Duffie notes, there have been many papers published about belief disagreements, and much work done on financial innovation, “but as far as I know this is the only paper that puts the two together.” The paper also suggests a need for further empirical research, he says, to test Simsek’s theory about belief disagreement and speculative variance.\n“It’s a pure theory paper, so you often want to have someone come along afterward and measure empirically how big the effect is,” Duffie says.\nFor his part, Simsek says, he would be happy to see empirical research probing his model. It would be beneficial, he thinks, for economists “to engage in a quantitative analysis, asset by asset, to think about the net effect [of speculative variance]. That’s a tough question, but one I think we should tackle going forward.”", "tags": ["Economics", "Humanities", "Investing", "Risk analysis", "Social sciences", "Stock Market", "Finance"], "title": "Rethinking investment risk"}