{"content": "Plastic is becoming a major problem worldwide: In 2012, the United States alone produced roughly 32 million tons of plastic waste, while only recycling about 9 percent of its plastic, according to the Environmental Protection Agency.\nThis is because of the growing use of nonrecycled plastics, primarily made of polystyrene and polypropylene. Seeing little return value, recyclers toss these plastics into landfills, where they pile up and never decompose. As a result, landfill space is becoming a concern.\nBut now MIT spinout PK Clean, founded by Priyanka Bakaya MBA 11, aims to end the landfilling of plastic with a cost-effective system that breaks down nonrecycled plastics into oil, while reusing some of the gas it produces to operate.\nPlastic comes from oil to begin with, so it makes sense, instead of landfilling plastic, to convert it back to usable fuel, Bakaya says. The goal is to end landfilled plastic waste forever  not just domestically, but also globally.\nPK Cleans so-called continuous system  the first of its kind in the United States, according to Bakaya  runs on a process called catalytic depolymerization, where heat and a catalyst break down plastics into crude oil to sell to refineries.\nAbout 70 to 80 percent of the product comes out as oil. Roughly 10 to 20 percent becomes hydrocarbon gas that heats the system, while the remainder is char residue.\nFollowing a trial in Pune, India, PK Clean last year built and installed its first full-scale commercial plant in Salt Lake City, partnering with Rocky Mountain Recycling, Utahs largest recycler.\nOperating continuously, the plant can convert up to 10 tons of plastic per day into 60 barrels of oil, with zero toxic emissions. Produced at around $35 per barrel, the oil is sold to a nearby refinery for around $100 per barrel.\nAfter nearly a year of operations in Utah, PK Clean plans to partner with other recyclers across the nation. Eventually, Bakaya says the plan is to move to developing countries, where plastic waste is even more of an issue.\nPushing the envelope in design\nPlastics come in seven categories: Type 1 (such as water bottles and soda bottles) and type 2 (foggy plastics, such as milk cartons) are easily recycled. But types 3 through 7  including plastic foam, disposable utensils, plastic pipes, food-storage containers, and shampoo bottles  are either not easily recycled or unrecyclable.\nTo convert these plastics into oil, PK Clean first shreds them. The shreds are then entered into a reactor  which runs at about 400 degrees Celsius  where a catalyst helps degrade the plastics long carbon chains. This produces a vapor that runs through a condenser, where its made into oil.\nSystems using similar processes have been around for years. But these have been too energy-inefficient and costly for recyclers to adopt. On the other hand, PK Cleans system, Bakaya says, costs a quarter the price of other systems to run, while producing greater yields.\nWe had to push the envelope with the design and operating costs to make something that can be adopted and easily used, Bakaya says.\nMuch of the systems innovation is in its continuous operation. Other systems operate through batch processing, where reactors heat up and then cool down again before the next batch is ready  wasting significant energy and money. But the hydrocarbon gas produced by PK Cleans system maintains the reactors heat, avoiding constant rebooting and energy loss.\nAdditionally, PK Clean adds a catalyst that helps produce greater yields in the conversion process. Automated controls also make the system much easier to use.\nWithin two years, Bakaya says, PK Clean aims to produce more refined fuel that recyclers can immediately pump back into their recycling trucks, without the need for oil refineries.\nThe system is pretty close, but we have to be on the exact specs, so wed rather let a refinery handle that now, Bakaya says.\nThroughout 2011, PK Clean won awards and funding from tech entrepreneurship competitions, including the MIT Clean Energy Prize (track winner), the MassChallenge (winner), the Rice Business Plan Competition (best energy business plan), and the Cleantech Open (runner-up for the national grand prize, and track winner).\nSince then, Fortune, Forbes, Inc., and other publications have praised the company for its innovation, and lauded Bakaya as a top entrepreneur in clean energy.\nA clean-tech journey\nGrowing up in Australia, Bakaya was introduced to clean technologies through a close family friend, inventor Percy Kean  the creator of PK Cleans catalytic depolymerization technology, and the PK in the companys name.\nKean had spent decades researching and inventing clean technologies in his home, even turning his kitchen into a lab. Bakaya and her family would visit him often. Hed show me oil samples, light it with a match, and say it came from waste. That sparked my imagination, she says.\nThose fond memories lingered during Bakayas undergraduate years at Stanford University, and during her career forecasting oil prices on Wall Street in the mid-2000s. Oil had then crept up to about $140 per barrel, ushering in a new demand for clean energy. So when Kean died in 2007, Bakaya set out to commercialize his work.\nVisiting a friend who was studying chemical engineering at MIT, Bakaya sat in on an MIT Sloan School of Management class, 15.366 (Energy Ventures)  taught by Bill Aulet, managing director of the Martin Trust Center for MIT Entrepreneurship  where she saw a path forward.\nI thought, Wow, this is exactly what I need to get started on setting up this company, she says.\nEnrolling in MIT Sloan, she spent two years building her company. Classes such as 15.366, where students incrementally design business plans, really push you to think about all aspects of the business, Bakaya says.\nThrough that class, she also met graduate student Arjun Gupta SM 11, who helped with early designs of the system.\nOutside the classroom, she frequented MITs Entrepreneurship Club and Energy Club, where she found support among dozens of other hopeful entrepreneurs. Having other people going through the same thing is something I wouldnt have had if I hadnt gone to MIT, Bakaya says. Today, this close group of 30 to 40 budding entrepreneurs still help one another promote their businesses via social media.\nAfter graduation, she says, PK Clean benefitted  and continues to benefit  from the MIT brand name. Apart from lending credibility to the technology, Bakaya believes coming from MIT helped the company find early investors, and get chosen for a Bay Area incubator.Looking back, those three things at MIT  the classes, the network, and the brand name  have been an enormous help in launching the company and getting started, Bakaya says. PK Clean wouldnt be possible without MIT.", "tags": ["Innovation and Entrepreneurship (I&E)", "Startups", "Alumni/ae", "MIT Sloan School of Management", "Plastics", "Recycling", "Oil and gas", "Sustainability", ""], "title": "Solving the world’s plastic problem"}