{"content": "When cells suffer too much DNA damage, they are usually forced to undergo programmed cell death, or apoptosis. However, cancer cells often ignore these signals, flourishing even after chemotherapy drugs have ravaged their DNA.\nA new finding from MIT researchers may offer a way to overcome that resistance: The team has identified a key protein involved in an alternative death pathway known as programmed necrosis. Drugs that mimic the effects of this protein could push cancer cells that are resistant to apoptosis into necrosis instead.\nWhile apoptosis is a tightly controlled procedure that breaks down and disposes of the dying cell in a very orderly way, necrosis is a messier process in which the cells membrane ruptures and its contents spill out.\nPeople really used to think of necrosis as cells just falling apart, that it wasnt programmed and didnt require gene products to make it happen, says Leona Samson, a member of MITs Center for Environmental Health Sciences and Koch Institute for Integrative Cancer Research. In the last few years it has become more clear that this is an active process that requires proteins to take place.\nIn the May 10 online edition of the journal Genes and Development, Samson and colleagues report that a protein known as ALKBH7 plays a key role in controlling the programmed necrosis pathway. Dragony Fu, a former postdoc in Samsons lab, is the papers lead author, and postdoc Jennifer Jordan is also an author.\nUnexpected findings\nALKBH7 belongs to a family of proteins first discovered in E. coli about a dozen years ago as part of a DNA-repair mechanism. In humans, there are nine different ALKBH proteins, which Samsons lab has been studying for several years.\nMost of the mammalian ALKBH proteins appear to be involved in DNA repair, similar to the original E. coli version. In particular, they respond to DNA damage caused by alkylating agents. These agents can be found in pollutants such as fuel exhaust and tobacco smoke, and are also used to treat cancer.\nIn the new paper, Samson, a professor of biology and biological engineering, and her colleagues found that ALKBH7 has an unexpected effect. When the researchers lowered ALKBH7 levels in human cells grown in the lab, those cells were much more likely to survive DNA damage than cells with normal ALKBH7 levels. This suggests that ALKBH7 actually promotes cell death.\nThat was a surprising finding, because previously all of these ALKBH proteins were shown to be helping the cell survive when exposed to damage, says Fu, who is now a visiting research fellow at the University of Zurich.\nUpon further investigation, the researchers found that when healthy cells suffer massive DNA damage from alkylating agents, they enter the programmed necrosis pathway. Necrosis, which can also be initiated by bacterial or viral infection, is believed to help the bodys immune system detect threats.\nWhen dying cells release their contents during necrosis, it serves as a warning signal for your body that there is a virus there and recruits macrophages and other immune cells to the area, Fu says.\nPotential drug targets\nThe findings suggest that when DNA is so badly harmed that cells cant repair it, the programmed necrosis pathway kicks in to prevent cells with major genetic damage from potentially become cancerous.\nOther researchers have shown that some types of cancer cells have much lower ALKBH7 levels than normal cells. This suggests that the cancer cells have gained the ability to evade programmed necrosis, helping them to survive, Fu says.\nThe necrosis pathway appears to be initiated by an enzyme called PARP, which becomes hyperactive following DNA damage and shuts down the cells production of two molecules that carry energy, ATP and NAD. The MIT team found that ALKBH7 prevents ATP and NAD levels from returning to normal by disrupting the function of mitochondria  the cell structures that generate energy for a cell.\nWithout an adequate supply of those critical energy-carrying molecules, the cell cannot survive and undergoes necrosis. In cells that lack ALKBH7, ATP and NAD levels rebound, and the cells survive, carrying a heavy burden of DNA damage.\nThe researchers are now investigating the molecular details of the programmed necrosis pathway in hopes of identifying ways to activate it in cancer cells.\nThe observations reported in this paper open up the possibility that novel treatments could be developed to treat tumors that are relatively resistant to killing via the apoptotic pathway, says Ashok Bhagwat, a professor of chemistry at Wayne State University who was not part of the research team.\nThe research was funded by the National Institutes of Health and the American Cancer Society.", "tags": ["Biological engineering", "Biology", "Cancer", "Alkylating agents", "Apoptosis (cell suicide)", "Cells", "Center for Environmental Health Sciences (CEHS)", "Koch Institute", "Necrosis"], "title": "Study IDs key protein for cell death"}