{"content": "MIT chemists have developed new nanoparticles that can simultaneously perform magnetic resonance imaging (MRI) and fluorescent imaging in living animals. Such particles could help scientists to track specific molecules produced in the body, monitor a tumor’s environment, or determine whether drugs have successfully reached their targets.\nIn a paper appearing in the Nov. 18 issue of Nature Communications, the researchers demonstrate the use of the particles, which carry distinct sensors for fluorescence and MRI, to track vitamin C in mice. Wherever there is a high concentration of vitamin C, the particles show a strong fluorescent signal but little MRI contrast. If there is not much vitamin C, a stronger MRI signal is visible but fluorescence is very weak.\nFuture versions of the particles could be designed to detect reactive oxygen species that often correlate with disease, says Jeremiah Johnson, an assistant professor of chemistry at MIT and senior author of the study. They could also be tailored to detect more than one molecule at a time.\n“You may be able to learn more about how diseases progress if you have imaging probes that can sense specific biomolecules,” Johnson says.\nDual action\nJohnson and his colleagues designed the particles so they can be assembled from building blocks made of polymer chains carrying either an organic MRI contrast agent called a nitroxide or a fluorescent molecule called Cy5.5.\nWhen mixed together in a desired ratio, these building blocks join to form a specific nanosized structure the authors call a branched bottlebrush polymer. For this study, they created particles in which 99 percent of the chains carry nitroxides, and 1 percent carry Cy5.5.\nNitroxides are reactive molecules that contain a nitrogen atom bound to an oxygen atom with an unpaired electron. Nitroxides suppress Cy5.5’s fluorescence, but when the nitroxides encounter a molecule such as vitamin C from which they can grab electrons, they become inactive and Cy5.5 fluoresces.\nNitroxides typically have a very short half-life in living systems, but University of Nebraska chemistry professor Andrzej Rajca, who is also an author of the new Nature Communications paper, recently discovered that their half-life can be extended by attaching two bulky structures to them.  Furthermore, the authors of the Nature Communications paper show that incorporation of Rajca’s nitroxide in Johnson’s branched bottlebrush polymer architectures leads to even greater improvements in the nitroxide lifetime. With these modifications, nitroxides can circulate for several hours in a mouse’s bloodstream — long enough to obtain useful MRI images.\nThe researchers found that their imaging particles accumulated in the liver, as nanoparticles usually do. The mouse liver produces vitamin C, so once the particles reached the liver, they grabbed electrons from vitamin C, turning off the MRI signal and boosting fluorescence. They also found no MRI signal but a small amount of fluorescence in the brain, which is a destination for much of the vitamin C produced in the liver. In contrast, in the blood and kidneys, where the concentration of vitamin C is low, the MRI contrast was maximal.\nMixing and matching\nThe researchers are now working to enhance the signal differences that they get when the sensor encounters a target molecule such as vitamin C. They have also created nanoparticles carrying the fluorescent agent plus up to three different drugs. This allows them to track whether the nanoparticles are delivered to their targeted locations.\n“That’s the advantage of our platform — we can mix and match and add almost anything we want,” Johnson says.\nThese particles could also be used to evaluate the level of oxygen radicals in a patient’s tumor, which can reveal valuable information about how aggressive the tumor is.\n“We think we may be able to reveal information about the tumor environment with these kinds of probes, if we can get them there,” Johnson says. “Someday you might be able to inject this in a patient and obtain real-time biochemical information about disease sites and also healthy tissues, which is not always straightforward.”\nSteven Bottle, a professor of nanotechnology and molecular science at Queensland University of Technology, says the most impressive element of the study is the combination of two powerful imaging techniques into one nanomaterial.\n“I believe this should deliver a very powerful, metabolically linked, multi-combination imaging modality which should provide a highly useful diagnostic tool with real potential to follow disease progression in vivo,” says Bottle, who was not involved in the study.\nThe research was funded by the National Institutes of Health, the Department of Defense, the National Science Foundation, and the Koch Institute for Integrative Cancer Research.", "tags": ["Chemistry", "Imaging", "Magnetic resonance imaging (MRI)", "Cancer", "Nanoscience and nanotechnology", "Medicine", "Research", "School of Science", "National Institutes of Health (NIH)", ""], "title": "Two sensors in one"}