{"content": "When people get together in groups, unusual things can happen  both good and bad. Groups create important social institutions that an individual could not achieve alone, but there can be a darker side to such alliances: Belonging to a group makes people more likely to harm others outside the group.\nAlthough humans exhibit strong preferences for equity and moral prohibitions against harm in many contexts, peoples priorities change when there is an us and a them, says Rebecca Saxe, an associate professor of cognitive neuroscience at MIT. A group of people will often engage in actions that are contrary to the private moral standards of each individual in that group, sweeping otherwise decent individuals into mobs that commit looting, vandalism, even physical brutality.\nSeveral factors play into this transformation. When people are in a group, they feel more anonymous, and less likely to be caught doing something wrong. They may also feel a diminished sense of personal responsibility for collective actions.\nSaxe and colleagues recently studied a third factor that cognitive scientists believe may be involved in this group dynamic: the hypothesis that when people are in groups, they lose touch with their own morals and beliefs, and become more likely to do things that they would normally believe are wrong.\nIn a study that recently went online in the journal NeuroImage, the researchers measured brain activity in a part of the brain involved in thinking about oneself. They found that in some people, this activity was reduced when the subjects participated in a competition as part of a group, compared with when they competed as individuals. Those people were more likely to harm their competitors than people who did not exhibit this decreased brain activity.\nThis process alone does not account for intergroup conflict: Groups also promote anonymity, diminish personal responsibility, and encourage reframing harmful actions as necessary for the greater good. Still, these results suggest that at least in some cases, explicitly reflecting on ones own personal moral standards may help to attenuate the influence of mob mentality, says Mina Cikara, a former MIT postdoc and lead author of the NeuroImage paper.\nGroup dynamics\nCikara, who is now an assistant professor at Carnegie Mellon University, started this research project after experiencing the consequences of a mob mentality: During a visit to Yankee Stadium, her husband was ceaselessly heckled by Yankees fans for wearing a Red Sox cap. What I decided to do was take the hat from him, thinking I would be a lesser target by virtue of the fact that I was a woman, Cikara says. I was so wrong. I have never been called names like that in my entire life.\nThe harassment, which continued throughout the trip back to Manhattan, provoked a strong reaction in Cikara, who isnt even a Red Sox fan.\nIt was a really amazing experience because what I realized was I had gone from being an individual to being seen as a member of Red Sox Nation. And the way that people responded to me, and the way I felt myself responding back, had changed, by virtue of this visual cue  the baseball hat, she says. Once you start feeling attacked on behalf of your group, however arbitrary, it changes your psychology.\nCikara, then a third-year graduate student at Princeton University, started to investigate the neural mechanisms behind the group dynamics that produce bad behavior. In the new study, done at MIT, Cikara, Saxe (who is also an associate member of MITs McGovern Institute for Brain Research), former Harvard University graduate student Anna Jenkins, and former MIT lab manager Nicholas Dufour focused on a part of the brain called the medial prefrontal cortex. When someone is reflecting on himself or herself, this part of the brain lights up in functional magnetic resonance imaging (fMRI) brain scans.\nA couple of weeks before the study participants came in for the experiment, the researchers surveyed each of them about their social-media habits, as well as their moral beliefs and behavior. This allowed the researchers to create individualized statements for each subject that were true for that person  for example, I have stolen food from shared refrigerators or I always apologize after bumping into someone.\nWhen the subjects arrived at the lab, their brains were scanned as they played a game once on their own and once as part of a team. The purpose of the game was to press a button if they saw a statement related to social media, such as I have more than 600 Facebook friends.\nThe subjects also saw their personalized moral statements mixed in with sentences about social media. Brain scans revealed that when subjects were playing for themselves, the medial prefrontal cortex lit up much more when they read moral statements about themselves than statements about others, consistent with previous findings. However, during the team competition, some people showed a much smaller difference in medial prefrontal cortex activation when they saw the moral statements about themselves compared to those about other people.\nThose people also turned out to be much more likely to harm members of the competing group during a task performed after the game. Each subject was asked to select photos that would appear with the published study, from a set of four photos apiece of two teammates and two members of the opposing team. The subjects with suppressed medial prefrontal cortex activity chose the least flattering photos of the opposing team members, but not of their own teammates.\nThis is a nice way of using neuroimaging to try to get insight into something that behaviorally has been really hard to explore, says David Rand, an assistant professor of psychology at Yale University who was not involved in the research. Its been hard to get a direct handle on the extent to which people within a group are tapping into their own understanding of things versus the groups understanding.\nGetting lost\nThe researchers also found that after the game, people with reduced medial prefrontal cortex activity had more difficulty remembering the moral statements they had heard during the game.\nIf you need to encode something with regard to the self and that ability is somehow undermined when youre competing with a group, then you should have poor memory associated with that reduction in medial prefrontal cortex signal, and thats exactly what we see, Cikara says.\nCikara hopes to follow up on these findings to investigate what makes some people more likely to become lost in a group than others. She is also interested in studying whether people are slower to recognize themselves or pick themselves out of a photo lineup after being absorbed in a group activity.\nThe research was funded by the Eunice Kennedy Shriver National Institute of Child Health and Human Development, the Air Force Office of Scientific Research, and the Packard Foundation.\n", "tags": ["Brain and cognitive sciences", "Behavior", "Magnetic resonance imaging (MRI)", "Faculty", "Research"], "title": "When good people do bad things"}