{"content": "Wind turbines across the globe are being made taller to capture more energy from the stronger winds that blow at greater heights.\nBut it’s not easy, or sometimes even economically feasible, to build taller towers, with shipping constraints on tower diameters and the expense involved in construction.\nNow Keystone Tower Systems — co-founded by Eric Smith ’01, SM ’07, Rosalind Takata ’00, SM ’06, and Alexander Slocum, the Pappalardo Professor of Mechanical Engineering at MIT — is developing a novel system that adapts a traditional pipe-making technology to churn out wind turbines on location, at wind farms, making taller towers more economically feasible. \nKeystone’s system is a modification of spiral welding, a process that’s been used for decades to make large pipes. In that process, steel sheets are fed into one side of a machine, where they’re continuously rolled into a spiral, while their edges are welded together to create a pipe — sort of like a massive paper-towel tube.\nDeveloped by Smith, Takata, and Slocum — along with a team of engineers, including Daniel Bridgers SM ’12 and Dan Ainge ’12 — Keystone’s system allows the steel rolls to be tapered and made of varying thickness, to create a conical tower. The system is highly automated — using about one-tenth the labor of traditional construction — and uses steel to make the whole tower, instead of concrete. “This makes it much more cost-effective to build much taller towers,” says Smith, Keystone’s CEO.\nWith Keystone’s onsite fabrication, Smith says, manufactures can make towers that reach more than 400 feet. Wind that high can be up to 50 percent stronger and, moreover, isn’t blocked by trees, Smith says. A 460-foot tower, for instance, could increase energy capture by 10 to 50 percent, compared with today’s more common 260-foot towers.\n“That’s site-dependent,” Smith adds. “If you go somewhere in the Midwest where there’s open plains, but no trees, you’re going to see a benefit, but it might not be a large benefit. But if you go somewhere with tree cover, like in Maine — because the trees slow down the wind near the ground — you can see a 50 percent increase in energy capture for the same wind turbine.”\nSolving transport problems\nThe Keystone system’s value lies in skirting wind-turbine transportation constraints that have plagued the industry for years. Towers are made in segments to be shipped to wind farms for assembly. But they’re restricted to diameters of about 14 feet, so trucks can safely haul them on highways and under bridges.\nThis means that in the United States, most towers for 2- or 3-megawatt turbines are limited to about 260 feet. In Europe, taller towers (up to about 460 feet) are becoming common, but these require significant structural or manufacturing compromises: They’re built using very thick steel walls at the base (requiring more than 100 tons of excess steel), or with the lower half of the tower needing more than 1,000 tons of concrete blocks, or pieced together with many steel elements using thousands of bolts.\n“If you were to design a 500-foot tower to get strong winds, based on the force exerted on a turbine, you’d want something at least 20 feet in diameter at the base,” Smith explains. “But there’s no way to weld together a tower in a factory that’s 20 feet in diameter and ship it to the wind farm.”\nInstead, Keystone delivers its mobile, industrial-sized machine and the trapezoid-shaped sheets of steel needed to feed into the system. Essentially, the sheets are trapezoids of increasing sizes — with the shorter size fed into the machine first, and the longest piece fed in last. (If you laid all the sheets flat, edge-to-edge, they’d form an involute spiral.) Welding their edges assembles the sheets into a conical shape. The machine can make about one tower per day.\nAny diameter is possible, Smith says. For 450-foot, 3-megawatt towers, a base 20 feet in diameter will suffice. (Increasing diameters by even a few feet, he says, can make towers almost twice as strong to handle stress.)\nSmith compares the process to today’s at-home installation of rain gutters: For that process, professionals drive to a house and feed aluminum coils into one end of a specialized machine that shapes the metal into a seamless gutter. “It’s a better alternative to buying individual sections and bringing them home to assemble,” he says. “Keystone’s system is that, but on a far, far grander scale.”\nBehind Keystone\nSmith, who studied mechanical engineering and electrical engineering and computer science at MIT, conceived of a tapered spiral-welding process while conducting an independent study on wind-energy issues with Slocum.\nRunning a consulting company for machine design after graduating from MIT, Smith was vetting startups and technologies in wind energy, and other industries, for investors. As wind energy picked up steam about five years ago, venture capitalists soon funded Smith, Slocum, and other wind-energy experts to study opportunities for cost savings in large, onshore wind turbines.\nThe team looked, for instance, at developing advanced drivetrain controls and rotor designs. “But out of that study we spotted tower transport as one of the biggest bottlenecks holding back the industry,” Smith says.\nWith Slocum’s help, Smith worked out how to manipulate spiral-welding machines to make tapered tubes and, soon thereafter, along with Slocum, designed a small-scale, patented machine funded by a $1 million Department of Energy grant. In 2010, Smith and Slocum launched Keystone with Rosalind Takata ’01, SM ’06 to further develop the system in Somerville, Mass. The company has since relocated its headquarters to Denver.\nIn launching Keystone, Smith gives some credit to MIT’s Venture Mentoring Service (VMS), which advised the startup’s co-founders on everything from early company formation to scaling up the business. Smith still keeps in touch with VMS for advice on overcoming common commercialization roadblocks, such as obtaining and maintaining customers.\n“It’s been extremely valuable,” he says of VMS. “There are many different topics that come up when you’re founding an early-stage company, and it’s good to have advisors who’ve seen it all before.”\nOpening up the country\nKeystone is now conducting structural validation of towers created by its system in collaboration with structural engineers at Northeastern University and Johns Hopkins University. For the past year, the startup’s been working toward deploying a small-scale prototype (about six stories high) at the MIT-owned Bates Linear Accelerator Center in Middleton, Mass., by early 2015.\nBut last month, Keystone received another $1 million DOE grant to design the full mobile operation. Now, the company is working with the Danish wind-turbine manufacturer Vestas Wind Systems, and other turbine makers, to plan out full-scale production, and is raising investments to construct the first commercial scale machine.\nAlthough their first stops may be Germany and Sweden — where taller wind towers are built more frequently, but using more expensive traditional methods — Smith says he hopes to sell the system in the United States, where shorter towers (around 260 feet) are still the norm.\nThe earliest adopters in the United States, he says, would probably be areas where there is strong wind, but also dense tree cover. In Maine, for example, there’s only a small percentage of the state where wind power is economically feasible today, because trees block wind from the state’s shorter turbines. In the Midwest, wind energy has already reached grid-parity, undercutting even today’s low-cost natural gas — but in areas like New England and the Southeast, taller towers are needed to reach the strong winds that make wind energy economically feasible.\n“Once you’re at the heights we’re looking at,” Smith says, “it really opens up the whole country for turbines to capture large amounts of energy.”", "tags": ["School of Engineering", "Electrical Engineering & Computer Science (eecs)", "Mechanical engineering", "Startups", "Innovation and Entrepreneurship (I&E)", "Wind", "wind energy", "Energy", "Alumni/ae"], "title": "Wind energy reaches greater heights"}